[
    {
      "Unique Controls": "AC-1",
      "AWS": "Customers are responsible for enabling session lock on their compute instances to meet the organization’s-defined parameter (GSA requires 15 minutes), and are responsible for ensuring the session lock mechanism, when activated on a device with a display screen, places a publicly viewable pattern onto the associated display, hiding what was previously visible on the screen.\nCustomers are responsible for enabling session lock on their compute instances to meet the organization’s-defined parameter, and are responsible for ensuring the session lock mechanism, when activated on a device with a display screen, places a publicly viewable pattern onto the associated display, hiding what was previously visible on the screen.",
      "GCP": "Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for assigning account managers for customer accounts used with GCP. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for identifying all customer-controlled accounts within the system. The customer control implementation statement should address all account types within the system in use and how each type supports a mission/business function. Example account types may include, but are not limited to: Azure Active Directory individual user accounts (used to manage access to Azure resources), operating system-level individual user accounts for IaaS virtual machines, database, shared server admin accounts, application-level individual user accounts.",
      "Cloud.gov": "Concurrent session control is delegated to the application owner."
    },
    {
      "Unique Controls": "AC-10",
      "AWS": "Customer connections to their compute instances in EC2, EBS, and VPC are accomplished through API calls or through the Apptis FedCloud Console. These connections are considered “remote connections” because these connections are initiated from an external location (the customer’s location) via the Internet to the Amazon API endpoint or Apptis FedCloud Console. Once their compute instances are setup, the customer agency is responsible for:\na. Documenting allowed methods of remote access to their compute instances\nb. Establishing usage restrictions and implementation guidance for each allowed remote access method\nc. Monitoring for unauthorized remote access to their compute instances\nd. Authorizes remote access to their compute instances prior to connection\ne. Enforces requirements for remote connections to their compute instances.\nCustomer connections to their compute instances in EC2/VPC/EBS are accomplished through API calls or through the Apptis FedCloud Console. These connections are considered “remote connections” because these connections are initiated from an external location (the customer’s location) via the Internet to the Amazon API endpoint or Apptis FedCloud Console. Once their compute instances are setup, the customer agency is responsible for:\"\n\"Customer agency connections to their storage resources in S3 are accomplished through API calls to their storage buckets in S3. These connections are considered “remote connections” because these connections are initiated from an external location (the customer’s location) via the Internet to the API endpoint. As such, customer agencies are responsible for: \n- Documenting allowed methods of remote access to their objects stored in S3 as noted above;\"\n- Establishing usage restrictions and implementation guidance for remote access via API\n- Setting up bucket logging in their customer storage buckets in order to monitor for unauthorized remote access to their objects stored in S3\n- Authorize remote access to their storage resources in S3 prior to connection by using signed API calls.\nCustomer agency connections to their storage resources in S3 are accomplished through API calls to their storage buckets in. These connections are considered “remote connections” because these connections are initiated from an external location (the customer’s location) via the Internet to the API endpoint.",
      "GCP": "Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for establishing conditions for group and role membership within any customer directory service used for customer accounts used with GCP.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for assigning managers to the accounts identified in AC-02.a. The customer control implementation statement should address how account managers are identified within the organization.",
      "Cloud.gov": "For UAA accounts used to manage the applications cloud.gov provides this control. Application accounts unless integrated with the UAA are the responsibility of the application owner.\nFor UAA accounts used to manage the applications cloud.gov provides this control. Application accounts unless integrated with the UAA are the responsibility of the application owner."
    },
    {
      "Unique Controls": "AC-11",
      "AWS": "Customers are responsible for ensuring that remote sessions for accessing security functions match the organization’s policy",
      "GCP": "Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for specifying authorized customer users of GCP, as well as any customer group or role memberships used with GCP. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for establishing role and group membership criteria for customer-controlled account types (see AC-02.a). The customer control implementation statement should address the criteria defined for group and role membership.",
      "Cloud.gov": "For UAA accounts used to manage the applications cloud.gov provides this control. Application accounts unless integrated with the UAA are the responsibility of the application owner."
    },
    {
      "Unique Controls": "AC-11(1)",
      "AWS": "Employing automated mechanisms to facilitate the monitoring and control of remote access methods to compute instances.\nCustomers are responsible for employing automated mechanisms to facilitate the monitoring and control of remote access methods to storage resources in S3.",
      "GCP": "Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for requiring approval for requests to create customer accounts within the customer directory system that is utilized with GCP. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for establishing an authorization process for all customer-controlled account types (see AC-02.a). The customer control implementation statement should address the process by which authorized users are specified and privilege levels are determined.",
      "Cloud.gov": "For UAA accounts used to manage the applications cloud.gov provides this control. Application accounts unless integrated with the UAA are the responsibility of the application owner."
    },
    {
      "Unique Controls": "AC-11a",
      "AWS": "Uses cryptography to protect the confidentiality and integrity of remote access sessions to compute resources.\nCustomers are responsible for using cryptography to protect the confidentiality and integrity of remote access sessions to storage resources in S3.",
      "GCP": "Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for creating, enabling, modifying and disabling information system accounts used to access GCP in accordance with customer procedures.\n\n There are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for requiring personnel to approve the creation of new accounts for the system. The customer control implementation statement should address the personnel or roles designated to approve all customer-controlled account types (see AC-02.a).",
      "Cloud.gov": "The authorization is the responsibility of the application owner.\nThe authorization is the responsibility of the application owner.\nThe application owner must make the request using commands available via the cloud.gov CLI, API, and web interface."
    },
    {
      "Unique Controls": "AC-11b",
      "AWS": "Routing all remote accesses through a limited number of managed access control points (AWS-provided API endpoints via the Apptis FedCloud Console).\nCustomers are responsible for routing all remote accesses through a limited number of managed access control points (GovCloud API endpoints).",
      "GCP": "Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for monitoring the use of information system accounts used to access GCP. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for establishing an account management process for all customer-controlled account types (see AC-02.a). The customer control implementation statement should address the account management process lifecycle from creation to disablement/removal.",
      "Cloud.gov": "Implementation and restrictions on mobile devices is the responsibility of the customer."
    },
    {
      "Unique Controls": "AC-12",
      "AWS": "Authorizing the execution of privileged commands and access to security-relevant information via remote access only for compelling operational needs and documents the rationale for such access in the security plan for the information system.\nCustomers are responsible for authorizing the execution of privileged commands and access to security-relevant information via remote access only for compelling operational needs and documents the rationale for such access in the security plan for the information system.",
      "GCP": "Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for notifying account managers when changes in account requirements, such as accounts no longer being required, occur to system accounts used to access GCP. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for monitoring the use of all customer-controlled accounts. The customer control implementation statement should address how the customer monitors account use, including the personnel or roles responsible for monitoring activities.",
      "Cloud.gov": "For UAA accounts (Cloud Foundry User Account and Authentication accounts, which includes cloud.gov users who log in via agency single sign-on or the cloud.gov identity provider) used to manage applications, cloud.gov provides this control. Application accounts unless integrated with the UAA are the responsibility of the application owner.\nFor UAA accounts used to manage the applications cloud.gov provides this control. Application accounts unless integrated with the UAA are the responsibility of the application owner.\nThe responsibility of not requesting or permitting shared UAA or application accounts is the responsibility of the application owner.\nFor UAA accounts used to manage the applications cloud.gov provides this control. Application accounts unless integrated with the UAA are the responsibility of the application owner. The delineation of higher privileged accounts in the application and their monitoring is the responsibility of the application owner.\nFor UAA accounts used to manage the applications cloud.gov provides this control. Application accounts unless integrated with the UAA are the responsibility of the application owner.\nFor UAA accounts used to manage the applications cloud.gov provides this control. Application accounts unless integrated with the UAA are the responsibility of the application owner.\nFor UAA accounts used to manage the applications cloud.gov provides this control. Application accounts unless integrated with the UAA are the responsibility of the application owner.\nFor UAA accounts used to manage the applications cloud.gov provides this control. Application accounts unless integrated with the UAA are the responsibility of the application owner.\nFor UAA accounts used to manage the applications cloud.gov provides this control. Application accounts unless integrated with the UAA are the responsibility of the application owner. The delineation of higher privileged accounts in the application and their monitoring is the responsibility of the application owner.\nThe responsibility of not requesting or permitting shared UAA or application accounts is the responsibility of the application owner."
    },
    {
      "Unique Controls": "AC-12(1)",
      "AWS": "Monitoring for unauthorized remote connections to their compute resources at the frequency determined acceptable by the organization and/or GSA requirements, and takes appropriate action if an unauthorized connection is discovered.\nCustomers are responsible for monitoring for unauthorized remote connections to their storage resources within the system boundary at the frequency determined acceptable by the organization, and takes appropriate action if an unauthorized connection is discovered.",
      "GCP": "Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for authorizing access to the system for accounts used to access GCP. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for notifying account managers (defined in AC-02.b) of all customer-controlled accounts when users are terminated or transferred, accounts are no longer required, or system usage or need-to-know changes. The customer control implementation statement should address the methods by which these triggering events are identified and the managers are notified.",
      "Cloud.gov": "Application owners are responsible for gaining approval before utilizing an external system as part of their application.\nApplication owners are responsible for restricting the use of portable storage devices on external information systems."
    },
    {
      "Unique Controls": "AC-14",
      "AWS": "Ensuring that remote sessions for accessing security functions match the organization’s policy and/or GSA guidance",
      "GCP": "Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for reviewing customer accounts used with GCP for compliance with account management requirements. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for authorizing access to the customer system. The customer control implementation statement should address the requirement that all system access is granted based on a valid authorization for a specific intended usage.",
      "Cloud.gov": "The sharing agreements are the responsibility of the application owner."
    },
    {
      "Unique Controls": "AC-17",
      "AWS": "Disabling networking protocols deemed to be non-secure by the organization and/or GSA except for explicitly identified components in support of specific operational requirements. (GSA requires the following to be disabled - * tftp, (trivial ftp) * X-Windows, Sun Open Windows * FTP * TELNET * IPX/SPX * NETBIOS * BlueTooth * RPC-services, like NIS or NFS * rlogin, rsh, rexec * SMTP (Simple Mail Transfer Protocol) (except as required for normal system operations) * RIP (Routing Information Protocol) (except as required for normal system operations) * DNS (Domain Name Services) (except as required for normal system operations) * UUCP (Unix-Unix Copy Protocol) * NNTP (Network News Transfer Protocol) * NTP (Network Time Protocol) (except as required for normal system operations) * Peer-to-Peer *and as identified in GSA IT Security Hardening Guidelines).\nCustomers are responsible for disabling networking protocols deemed to be non-secure by the organization except for explicitly identified components in support of specific operational requirements.",
      "GCP": "Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for establishing a process for reissuing shared or group credentials when individuals are removed from a group for group accounts used to access GCP. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for reviewing customer-controlled accounts at the required frequency to determine if accounts are compliant with all organization requirements. The customer control implementation statement should address the process used to review account compliance.",
      "Cloud.gov": "Application owners must decide which content is publicly accessible."
    },
    {
      "Unique Controls": "AC-17 (7)",
      "AWS": "Customers are responsible for all aspects of this control related to user account access to their compute instances, virtual networks, and block stores. Details of each aspect of EC2, VPC, and EBS are outlined below.\nVirtual EC2 instances are completely controlled by the customer agency. Customers have full root access or administrative control over accounts, services, and applications. AWS does not have any access rights to customer instances and cannot log into the guest OS.\nAWS recommends a base set of security best practices to include disabling password-only access to their servers, and utilizing some form of multi-factor authentication to gain access to their instances (or at a minimum certificate-based SSH Version 2 access).\nAdditionally, customers should employ a privilege escalation mechanism with logging on a per-user basis. For example, if the guest OS is Linux, after hardening their instance, they should utilize certificate-based SSHv2 to access the virtual instance, disable remote root login, use command-line logging, and use ‘sudo’ for privilege escalation.\nCustomers should generate their own key pairs in order to guarantee that they are unique, and not shared with other customers or with AWS.\nOnce a customer creates an Amazon EBS volume, the customer can attach it to an Amazon EC2 instance. Once attached, it will appear as a mounted device similar to any hard drive or other block device. At that point, the instance can interact with the volume just as it would with a local drive, formatting it with a file system or installing applications on it directly. The customer controls which EC2 instance an EBS volume may be attached to.\nThrough the AWS Management Console, Amazon Virtual Private Cloud (Amazon VPC) lets customers provision a private, isolated section of the Amazon Web Services (AWS) Cloud where customers can launch AWS resources in the customer-defined virtual network. Customers can leverage multiple layers of security, including security groups and network access control lists, to help control access to Amazon EC2 instances in each subnet. Implement VPC.\nUsing the Apptis Portal and/or AWS management console, customers are responsible for:\na. Establishing and administering privileged user accounts in accordance with a role-based access scheme that organizes information system and network privileges into roles\nb. Tracking and monitoring privileged role assignments.\nc. Disabling temporary, emergency, inactive accounts after a defined time period (GSA requires after 90 days).\nd. Implementing auditing of account creation, modification, disabling, and termination actions and notifying, as required, appropriate individuals.\"\n\"Customers are responsible for all aspects of this control related to user account access to objects stored in S3. Data stored in S3 is secure by default and only customer agencies have access to S3 resources they create. \n\nS3 supports multiple access control mechanisms. Customer agencies have the flexibility to control who can access their data as well as how, when, and where they can access it. Amazon S3 provides various access control mechanisms: Identity and Access Management (IAM) policies, Access Control Lists (ACLs), bucket policies, and query string authentication. \n\nIAM enables organizations with multiple employees to create and manage multiple users under a single AWS account. With IAM policies, customer agencies can grant IAM users granular control to S3 buckets and objects. \n\nCustomer agencies can use ACLs to selectively add (grant) certain permissions on individual objects. S3 Bucket Policies can be used to add or deny permissions across some or all of the objects within a single bucket. \n\nWith Query string authentication, customer agencies have the ability to share S3 objects through URLs that are valid for a predefined expiration time. Customer’s agencies can securely upload/download data to S3 via the SSL encrypted endpoints using the HTTPS protocol.\"\n\"Customers are responsible for: \n- Establishing and administering privileged user accounts in accordance with a role-based access scheme that organizes information system and network privileges into roles\"\n- Tracking and monitoring privileged role assignments.\n- Disabling temporary, emergency, inactive accounts after a defined time period.\n- Implementing auditing of account creation, modification, Disabling, and termination actions and notifying, as required, appropriat",
      "GCP": "Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for employing automated mechanisms to support the management of information system accounts used to access GCP.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for disabling temporary and emergency information system accounts used to access GCP in accordance with customer policy. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for automatically disabling inactive information system accounts used to access GCP in accordance with customer procedures. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for automatically auditing information system account actions for accounts used to access GCP and notifying appropriate personnel. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for requiring that customer users log out of information system accounts used to access GCP in accordance with customer procedures. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for utilizing an role-based access scheme for accounts used to access GCP. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for monitoring privileged role assignments for accounts used to access GCP. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for revoking privileged access when the access is no longer required for accounts used to access GCP. \n\nThere are no customer responsibilities for the GCI since it is not available for public use\"\n\"Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for establishing customer policies on the use of shared or group accounts used to access GCP.\n\n There are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for establishing customer policies on the use of shared or group accounts used to access GCP to include, if applicable, terminating customer shared or group account credentials when members leave the group. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for enforcing usage conditions per customer policy for customer system accounts used to access GCP. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for monitoring customer system accounts used to access GCP for atypical use. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for the reporting of atypical usage of customer information system accounts to appropriate customer roles. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for disabling information system accounts of customer users posing a significant risk within one hour of discovery of the risk. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for the management of customer-controlled shared/group account credentials when a user is removed from the shared/group account. The customer control implementation statement should address the process for reissuing shared/group account credentials when users are removed from that shared/group account.",
      "Cloud.gov": "For UAA accounts used to manage the applications cloud.gov provides this control. Application accounts unless integrated with the UAA are the responsibility of the application owner. The delineation of higher privileged accounts in the application and their monitoring is the responsibility of the application owner."
    },
    {
      "Unique Controls": "AC-17(1)",
      "AWS": "Customers are responsible for establishing groups and permissions in the management console, thereby, ensuring that the process is performed in accordance with the customer’s access control policy and the authorizations granted to the system users are approved as required.\nCustomers are responsible for establishing groups and permissions via API endpoints, thereby, ensuring that the process is performed in accordance with the customer’s access control policy and the authorizations granted to the system users are approved as required.",
      "GCP": "Customers are responsible for managing all aspects of access control for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for enforcing access for customer users to GCP resources in accordance to applicable customer access control policies. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for employing automated mechanisms to support account management activities for the account types defined in AC-02.a. The customer control implementation statement should address the automated mechanisms put in place for account management.",
      "Cloud.gov": "Routing required for outside interconnections can be handled by cloud.gov but must be requested and approved by the application owner prior to be putting into deployment."
    },
    {
      "Unique Controls": "AC-17(2)",
      "AWS": "Customers are responsible for accessing AWS via SSL endpoints. These encrypted endpoints are accessible from both the Internet and from within Amazon EC2, ensuring that data are transferred securely both within AWS and to and from sources outside of AWS.\nThe EC2 compute instance inbound firewall is configured in a default deny mode. Customers are responsible for explicitly open any ports as needed to allow inbound traffic.\nThe traffic may be restricted by protocol, by service port, as well as by source IP address (individual IP or CIDR block). The firewall is controlled not by the host/instance itself, but requires the customer’s X.509 certificate and key to authorize changes, thus adding an extra layer of security.\nCustomers are responsible for using API calls that can be encrypted with SSL to maintain confidentiality.\nCustomers are responsible for configuring end-to-end network isolation by using an IP address range of a customer agency’s choice, and routing all of network traffic between the customer agency’s virtual private cloud (VPC) and another network designated by the customer via an encrypted Internet Protocol security (IPsec) VPN.\"\nCustomers are responsible for configuring their bucket and object-level access controls, with defaults that only permit authenticated access by the bucket and/or object creator.\nCustomers are responsible for accessing S3 via SSL endpoints. These encrypted endpoints are accessible from both the Internet and from within S3 and EC2, ensuring that data are transferred securely both within AWS and to and from sources outside of AWS.e individuals.",
      "GCP": "Customers are responsible for controlling the flow of information within the customer’s system, including components built in GCP, and between the customer’s system and other interconnected systems. Customers may elect to use the Virtual Private Cloud (VPC) service within the GCP Networking product family to help address this requirement. VPC is a comprehensive set of Google-managed networking capabilities, including granular IP address range selection, routes, firewalls and Virtual Private Network (VPN). VPC allows customers to provision their GCP resources, connect them to each other, and isolate them from one another in a Virtual Private Cloud (VPC). \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for controlling the flow of information within the customer’s system, including components built in GCP. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for controlling the flow of information within the customer’s system, including separating data flows logically according to customer requirements. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for configuring the system to automatically remove or disable emergency and temporary accounts, if those accounts have been defined in AC-02.a. The customer control implementation statement should address the selection of removal or disablement of temporary and emergency accounts, and the time period during which those accounts are allowed to remain active before removal/disablement.",
      "Cloud.gov": "UAA accounts are handle by cloud.gov. Application System Owners have the ability to assign roles in their cloud.gov Orgs and Spaces with granular levels of access, such as Org Manager and Space Developer. Application System Owners are responsible for appropriately assigning these roles."
    },
    {
      "Unique Controls": "AC-17(3)",
      "AWS": "Customers are responsible for documenting and implementing the separation of duties of individuals as necessary, to prevent malevolent activity without collusion.\nCustomers are responsible for documenting and implementing the separation of duties of individuals as necessary, to prevent malevolent activity without collusion.",
      "GCP": "Customers are responsible for employing least privilege within the customer’s system, including components built in GCP. GCP’s Cloud Console service is part of the GCP Management Tools product family and is used by customers to manage their GCP services. To help address the least privilege requirement customers may elect to limit Cloud Console administrative access to a security group that contains only users who require that access. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for preventing any customer software except software explicitly documented from executing at higher privilege levels than the customer users executing the software. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for auditing the execution of privileged functions for all customer controlled components hosted on GCP.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for preventing non-privileged users from executing privileged functions for all customer controlled components hosted on GCP. GCP allows customers to assign administrative and non-administrative roles to customer accounts within GCP. Non-administrative roles cannot perform privileged functions within the customer’s GCP project, including disabling, circumventing, or altering implemented security safeguards/countermeasures. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for configuring the system to automatically disable user accounts (for account types identified in AC-02.a) after an organization-defined period of inactivity. The customer control implementation statement should address the automated mechanisms involved in disabling inactive accounts, and the time period during which those accounts are allowed to remain inactive before disablement.",
      "Cloud.gov": "The roles are defined by cloud.gov but the application owner must make the proper assignments to personnel to ensure least privilege is enforced."
    },
    {
      "Unique Controls": "AC-17(4)",
      "AWS": "Customers are responsible for employing the concept of least privilege, allowing only authorized accesses for their users (and processes acting on behalf of users) which are necessary to accomplish assigned tasks in accordance with organizational missions and business functions. Refer also to AC-5.",
      "GCP": "Customers are responsible for purging sensitive data from customer mobile devices with access to GCP after three consecutive failed logon attempts. Alternatively customers may utilize sufficiently strong encryption mechanisms to protect data on customer mobile devices with access to GCP. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for implementing an automated audit and notification system for the lifecycle of managing customer-controlled accounts. The customer control implementation statement should address how account changes will be audited and the personnel/roles notified.",
      "Cloud.gov": "For UAA accounts used to manage the applications cloud.gov provides this control. Application accounts unless integrated with the UAA are the responsibility of the application owner."
    },
    {
      "Unique Controls": "AC-17(5)",
      "AWS": "\"\"Customers are responsible for:\na. Enforcing an agency defined limit of consecutive invalid access attempts by a user (GSA requires not more than ten during an agency defined time period (GSA requires 30 minutes)\nb. Automatically locking the account for the organization’s defined time period (GSA requires 30 minutes), locking the account until it is released by an administrator, or delaying the next login prompt for the organization’s defined delay when the maximum number of unsuccessful attempts is exceeded.\"\"\n\"\"If applicable to the customer’s environment, customers are responsible for: \n- Enforcing an agency defined limit of consecutive invalid access attempts by a user during an agency defined time period; and\"\"\"\n- Automatically locking the account for the organization’s defined time period, locking the account until it is released by an administrator, or delaying the next login prompt for the organization’s defined delay when the maximum number of unsuccessful attempts is exceeded.",
      "GCP": "Customers are responsible for displaying the appropriate system use banner to customer users before granting access to any customer systems. The system use banner should provide privacy and security notices consistent with applicable federal laws, Executive Orders, directives, policies, regulations, standards, and guidance. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for enforcing an inactivity log out policy. The customer control implementation statement should address the period of inactivity and/or the description of when to log out.",
      "Cloud.gov": "For UAA accounts used to manage the applications cloud.gov provides this control. Application accounts unless integrated with the UAA are the responsibility of the application owner."
    },
    {
      "Unique Controls": "AC-17(7)",
      "AWS": "Customers are responsible for implementing their agency’s banner or a GSA defined system use notification banner to display upon login to their EC2 compute instances.\nIf applicable to the customer’s environment, customers are responsible for implementing their agency’s banner or a system use notification banner to display upon login to their S3 storage.",
      "GCP": "Customers are responsible for retaining the notification message or banner on the screen until customer users acknowledge the usage conditions and take explicit actions to log on to or further access the customer information system. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for administering privileged user accounts using a role based access scheme (for customer-controlled accounts). The customer control implementation statement should address the organizations role-based access scheme and how it is used to establish and administer privileged user accounts.",
      "Cloud.gov": "cloud.gov inherits its implementation from GSA. The application leveraging cloud.gov will need to inherit the use of their agency's security policy. GSA applications can inherit cloud.gov's implementations."
    },
    {
      "Unique Controls": "AC-17(8)",
      "AWS": "Customers are responsible for retaining audit records online for a predetermined time (GSA requires not less than 180 days) and should further preserve audit records off-line for a period that is in accordance with NARA requirements to provide support for after-the-fact investigations of security incidents and to meet regulatory and organizational information retention requirements.\nCustomers are responsible for retaining audit records online for a predetermined time and should further preserve audit records off-line for a period that is in accordance with NARA requirements to provide support for after-the-fact investigations of security incidents and to meet regulatory and organizational information retention requirements.",
      "GCP": "Customers are responsible for:\nDisplaying system use information for publicly accessible customer systems before granting further access\nDisplaying references, if any, to monitoring, recording, or auditing that are consistent with privacy accommodations for such systems that generally prohibit those activities\nIncluding a description of the authorized uses of the system.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for monitoring privileged roles of customer-controlled accounts. The customer control implementation statement should address the mechanisms used for monitoring privileged role assignments.",
      "Cloud.gov": "cloud.gov inherits its implementation from GSA. The application leveraging cloud.gov will need to inherit the use of their agency's security training. GSA applications can inherit cloud.gov's implementations."
    },
    {
      "Unique Controls": "AC-17(9)",
      "AWS": "It’s the customer’s responsibility to ensure their information system:\na. Provides audit record generation capability for the list of auditable events defined in AU-2 at all information system components where audit capability is deployed.\nb. Allows designated organizational personnel to select which auditable events are to be audited by specific components of the system\nc. Generates audit records for the list of audited events defined in AU-2 with the content as defined in AU-3.\"\n\"It is the customer’s responsibility to ensure their information system: \n- Provides audit record generation capability for the list of auditable events defined in AU-2 at all information system components where audit capability is deployed.\"\n- Allows designated organizational personnel to select which auditable events are to be audited by specific components of the system\n- Generates audit records for the list of audited events defined in AU-2 with the content as defined in AU-3.",
      "GCP": "Customers are responsible for limiting the number of concurrent sessions for customer users according to customer account type. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for taking action on customer-controlled accounts when privileged role assignments are no longer appropriate. The customer control implementation statement should address the actions to be taken when a user no longer requires a privileged role.",
      "Cloud.gov": "cloud.gov inherits its implementation from GSA. The application leveraging cloud.gov will need to inherit the use of their agency's security training. GSA applications can inherit cloud.gov's implementations. Application owners must identify application personnel to receive appropriate role-based training."
    },
    {
      "Unique Controls": "AC-18",
      "AWS": "Customers are responsible for establishing, implementing, reviewing configuring and updating auditable events on their storage resources and virtual machines, based on a risk assessment and mission/business needs. The collection and protection of these audits belongs to the customer as well.\nCustomers are responsible for establishing, implementing, reviewing configuring and updating auditable events on their storage resources and virtual machines, based on a risk assessment and mission/business needs. The collection and protection of these audits belongs to the customer as well.",
      "GCP": "Customers are responsible for initiating a session lock for customer sessions after 15 minutes of inactivity or upon receiving a request from a user. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for restricting the use of customer-controlled shared/group accounts. The customer control implementation statement should address the organizations specific requirements for the establishment of a shared/group accounts.",
      "Cloud.gov": "cloud.gov inherits its implementation from GSA. The application leveraging cloud.gov will need to inherit the use of their agency's security policy. GSA applications can inherit cloud.gov's implementations."
    },
    {
      "Unique Controls": "AC-18(1)",
      "AWS": "Customers are responsible for reviewing and updating the list of auditable events annually or whenever there is a change in the threat environment.\nCustomers are responsible for reviewing and updating the list of auditable events annually or whenever there is a change in the threat environment.",
      "GCP": "Customers are responsible for retaining session locks until the customer user reestablishes access using established customer identification and authentication procedures. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for the termination of customer-controlled shared/group account credentials. The customer control implementation statement should address the process for terminating shared/group credentials when a member leaves.",
      "Cloud.gov": "cloud.gov inherits its implementation from GSA. The application leveraging cloud.gov will need to inherit the use of their agency's security policy. GSA applications can inherit cloud.gov's implementations."
    },
    {
      "Unique Controls": "AC-19",
      "AWS": "Customers are responsible for auditing the execution of privileged functions in the list of events to be audited by the information system\nCustomers are responsible for auditing the execution of privileged functions in the list of events to be audited by the information system.",
      "GCP": "Customers are responsible ensuring customer systems conceal, via a session lock, information previously visible on the display with a publicly viewable image. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for monitoring customer-controlled accounts for atypical usage. The customer control implementation statement should address the criteria defining atypical account behavior, and the mechanisms used to monitor that criteria.",
      "Cloud.gov": "Application owner must ensure that cloud.gov retains their audit records to their time requirements. Application owners must ensure their storage capacity meets their retention requirements."
    },
    {
      "Unique Controls": "AC-19(5)",
      "AWS": "Customers are responsible for ensuring the information system produces audit records that contain sufficient information to, at a minimum, establish what type of event occurred, when (date and time) the event occurred, where the event occurred, the source of the event, the outcome (success or failure) of the event, and the identity of any user/subject associated with the event.\n\"\"Customers should also configure their information systems to audit for: (i) Session, connection, transaction, or activity duration.\n\n(ii) For client-server transactions, the number of bytes received and bytes sent. This gives bidirectional transfer information that can be helpful during an investigation or inquiry.\n\n(iii) For client-server transactions, unique metadata or properties about the client initiating the transaction. This could include properties such as an IP address, user name, session identifier or browser characteristics (e.g. a ‘User-Agent’ string).\n\n(iv) Details regarding the event ‘type’: the type of method (for HTTP: GET/POST/HEAD, etc) or action (Database INSERT, UPDATE, DELETE).\n\n(v) Characteristics that describe or identify the object or resource being acted upon.\n\n(vi) Additional informational messages to diagnose or identify the event.\"\"\"\nCustomers are responsible for ensuring the information system produces audit records that contain sufficient information to, at a minimum, establish what type of event occurred, when (date and time) the event occurred, where the event occurred, the source of the event, the outcome (success or failure) of the event, and the identity of any user/subject associated with the event.\nCustomers should configure their information systems to audit for session, connection, transaction, or activity duration; for client-server transactions, the number of bytes received and bytes sent; additional informational messages to diagnose or identify the event; characteristics that describe or identify the object or resource being acted upon.",
      "GCP": "Customers are responsible for ensuring that customer systems automatically terminate a user session after a customer defined condition occurs. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for ensuring that customer systems provide a logout capability for user-initiated communications sessions whenever authentication is used. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for ensuring that customer systems provide an explicit logout message to users indicating the reliable termination of authenticated communications sessions.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for reporting atypical behavior of customer-controlled accounts. The customer control implementation statement should address which personnel/roles will be notified when atypical account behavior occurs.",
      "Cloud.gov": "cloud.gov is responsible for all requirements of log generation for their monitoring tools. Application owned retention tools are the responsibility of the application owner."
    },
    {
      "Unique Controls": "AC-2",
      "AWS": "Customers should allocate sufficient audit record storage capacity and configure their auditing to reduce the likelihood of such capacity being exceeded.\nCustomers should allocate sufficient audit record storage capacity and configure their auditing to reduce the likelihood of such capacity being exceeded.",
      "GCP": "Customers are responsible for monitoring and controlling remote access methods to customer systems. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for implementing cryptographic mechanisms to protect the confidentiality and integrity of remote access sessions to customer systems. Additionally, customers are required to ensure that machines connecting to Google Cloud are configured to use appropriate encryption for Google-to-agency communications. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for ensuring that all customer remote accesses to the information system are via a customer defined number of managed network access control points. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for enforcing approved authorizations for logical access to customer-deployed resources. The customer control implementation statement should address the processes and/or mechanisms used to enforce the authorization to access system resources.",
      "Cloud.gov": "Application owners must ensure that the auditing provided by cloud.gov meets their requirements and must provide for additional auditing if needed.\nApplications must audit the required events and ensure cloud.gov meets the requirements or put other monitoring tools in place."
    },
    {
      "Unique Controls": "AC-2(1)",
      "AWS": "Customers should configure their information systems to:\na. Alert designated organizational officials in the event of an audit processing failure\nb. Shut down Moderate-impact systems.\"\n\"Customers should configure their information systems to: \n- Alert designated organizational officials in the event of an audit processing failure; and\"\n- Overwrite oldest audit records (low-impact systems)",
      "GCP": "GCP allows agency customer developers to write code and manage cloud resources to determine what audit logs are generated and for how long they are retained. It is the customer’s responsibility to ensure that customer developed systems hosted on GCP and managed by the customer are capable of auditing the appropriate auditable events.\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for controlling the flow of information within customer-deployed resources and between interconnected systems. The customer control implementation statement should address the customer’s information flow control policies and enforcement mechanisms.",
      "Cloud.gov": "cloud.gov will capture the events details that are possible for their captured logs. Application owner must ensure their tools meet their audit content record requirements."
    },
    {
      "Unique Controls": "AC-2(10)",
      "AWS": "Customers are responsible for:\na. Reviewing and analyzing information system audit records at least weekly for indications of inappropriate or unusual activity, and report’s findings to designated organizational officials; and\nb. Adjusting the level of audit review, analysis, and reporting within the information system when there is a change in risk to organizational operations, organizational assets, individuals, other organizations, or the Nation based on law enforcement information, intelligence information, or other credible sources of information.\"\n\"Customers are responsible for: \n- Reviewing and analyzing information system audit records at least weekly for indications of inappropriate or unusual activity, and report’s findings to designated organizational officials; and\"\n- Adjusting the level of audit review, analysis, and reporting within the information system when there is a change in risk to organizational operations, organizational assets, individuals, other organizations, or the Nation based on law enforcement information, intelligence information, or other credible sources of information.",
      "GCP": "GCP allows agency customer developers to write code and manage cloud resources to determine what audit records are generated and what information is contained within customer audit records. The GCP admin activity log produces audit records that contain sufficient information to, at a minimum, establish what type of event occurred, when (date and time) the event occurred, the source of the event, the outcome of the event, and the identity of any user/subject associated with the event. In the case of the admin activity log, “where the event occurred” is implied as occurring within the customer’s GCP projects, folders or organizations. In addition to the admin log available through the GCP Cloud Console, application logs on application activity are available through the GCP Cloud Console and customers have the option to customize logs for their applications.\nCustomers may elect to use several GCP tools like Admin Audit Logs and Data Access Logs to ensure that adequate logging exists to establish what type of event occurred, when (date and time) the event occurred, where the event occurred, the source of the event, the outcome (success or failure) of the event, and the identity of any user/subject associated with the event. Customers should ensure that they properly configure appropriate GCP audit logs where applicable and set up additional logs where needed.\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"GCP allows agency customer developers to write code and manage cloud resources. Agencies are able to determine what audit logs are generated and for how long they are retained. The GCP Admin Audit Logs and Data Access Logs include event start time, end time, request IP address/user agent, request payload, user identity and objects/resources being acted upon. It is the customer’s responsibility to ensure that customer developed systems hosted on GCP and managed by the customer include additional session specific information such as bytes transferred during a session that can be helpful during an investigation or inquiry.\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for separating information flows within customer-deployed resources. The customer control implementation statement should address the separations required by information type, and the mechanisms and/or techniques used to separate information flows.",
      "Cloud.gov": "Application owner must ensure that cloud.gov retains their audit records to their time requirements. Application owners must ensure their storage capacity meets their retention requirements."
    },
    {
      "Unique Controls": "AC-2(11)",
      "AWS": "Customers are responsible for configuring their information system to use internal system clocks to generate time stamps for audit records.\nCustomers are responsible for ensuring that their information system synchronizes internal information system clocks at a predetermined time (GSA requires at least hourly).\"\nCustomers are responsible for configuring their information system to use internal system clocks to generate time stamps for audit records.\nCustomers are responsible for ensuring that their information system synchronizes internal information system clocks at a predetermined time.",
      "GCP": "GCP allows agency customer developers to write code and manage cloud resources. This includes determining what audit logs are generated by customer systems hosted in GCP and the management of their retention policies. It is the customer’s responsibility to ensure that customer audit records generated for customer systems by both the Google systems and customer systems are maintained in storage systems with the appropriate audit record storage capacity. Customer agencies should allocate audit record storage capacity and configure auditing to reduce the likelihood of such capacity being exceeded by either increasing the amount of storage space for log storage within GCP or copying log data to a customer managed storage system outside of GCP.\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for the separation of duties across customer-controlled accounts. The customer control implementation statement should address how individual duties are defined and separated.",
      "Cloud.gov": "Application owners must ensure the cloud.gov audit alerts notify the proper personnel. All application owned monitoring tools muse be configured by the application owner to alert the appropriate staff."
    },
    {
      "Unique Controls": "AC-2(12)",
      "AWS": "Customers are responsible for ensuring their information system protects audit information and audit tools from unauthorized access, modification, and deletion.\nCustomers are responsible for ensuring their information system protects audit information and audit tools from unauthorized access, modification, and deletion.",
      "GCP": "For GCP, Google retains online audit logs for thirty (30) days. It will then be the responsibility of the customer to offload those audit log records from the GCP console within that 30-day window. At that point, the customer will be responsible for its own audit log review for any anomalous behavior within its GCP instance.\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for documenting the separation of duties across customer-controlled accounts. The customer control implementation statement should address which duties require separation and how they are separated.",
      "Cloud.gov": "Application owners are required to review application audit log activity and reports generated by cloud.gov.\nApplication owners are required to review application audit log activity and consolidated reports generated by cloud.gov."
    },
    {
      "Unique Controls": "AC-2(13)",
      "AWS": "The customer is responsible for guest operating systems, deployed applications, and configuration control of select networking resources such as EC2 host firewalls, and VPC internal network configuration. The customer is not responsible for the underlying cloud infrastructure. For EC2, AWS provides a Linux Amazon Machine Image (AMIs) for the guest operating system. The installation will be the minimum installation of the operating system, with no configuration applied to the ISO image. AWS does not perform patch management, system hardening, and does not provide any application support within the image.\nAt customer instantiation of an AMI, the vendor makes no warranties as to the patch level or configuration settings. Customer responsibility includes updating any instance to a recent patch level and configuring to suit specific needs.\nUpon deployment of AMIs, the customer assumes full administrator access and is responsible for performing additional configuration, patching, security hardening, vulnerability scanning and application installation, as necessary. AWS will not maintain administrator access to customer EC2 instances, EBS storage or VPCs.\nThe customer is responsible for establishing review policies for maintaining the baseline configuration for the Guest Operating System and any applications that they install on the instances EC2. These polices include, but are not limited to:\na. Reviewing the baseline configuration on an annual basis\nb. Defining the types of changes to the information system or the environment of operations that would require a review and update of the baseline configuration\nc. Retaining older versions of baseline configurations\nd. Defining the list of software programs allowed to operate on the virtual machine\ne. Implementing an authentication policy that governs the execution of software on the virtual machine.",
      "GCP": "GCP allows agency customer developers to write code and manage cloud resources. This includes using the internal system clocks of Google’s servers to generate time stamps for audit logs that are generated by customer systems hosted in GCP.\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for defining system access authorizations to support separation of duties across customer-controlled accounts. The customer control implementation statement should address the mechanisms in place to enforce the separation of duties.",
      "Cloud.gov": "Application owners may use the cloud.gov reduction tools but are responsible for defining the level of analysis and providing reduction techniques and technology for their application owned monitoring tools.\nApplication owners are responsible for reviewing application logs collected by cloud.gov."
    },
    {
      "Unique Controls": "AC-2(2)",
      "AWS": "The customer is responsible for establishing a Configuration Change Control process for their information systems built on the AWS infrastructure. This includes controlling the configuration of the guest Operating System and any applications that are installed on the customer’s instances EC2.",
      "GCP": "GCP allows agency customer developers to write code and manage cloud resources. This includes using time stamps for customer audit records that can be mapped to Coordinated Universal Time (UTC) or Greenwich Mean Time (GMT) and provides at least one second granularity of time measurement for audit logs that are generated by customer systems hosted in GCP.\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for enforcing least privilege across customer-controlled accounts. The customer control implementation statement should address the level of access required to perform each job function, and how the role based access control scheme enforces least privilege based upon organization requirements.",
      "Cloud.gov": "Timestamps are provided for cloud.gov generated and retained logs. Application owner monitoring tools must be configured by the application owner to use time stamps."
    },
    {
      "Unique Controls": "AC-2(3)",
      "AWS": "Additionally, the customer is responsible for testing, validating, analyzing changes to their information system built on the AWS infrastructure to determine potential security impacts, and documenting changes to the information system before implementing the changes on their operational systems built on the AWS infrastructure. This also includes the guest Operating System and any applications that are installed on the customer’s instances in EC2.",
      "GCP": "GCP allows agency customer developers to write code and manage cloud resources. Many GCP services generate audit logs for customer systems built on those GCP services. The audit logs are retained on GCP for a fixed period of time, after which they are deleted. Customers can configure a backup destination for these audit logs, to increase the retention period and increase the number of replicate copies of logs for backup purposes. The backup destination can be configured as a physically different service on GCP, or a service/system outside of GCP.\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"GCP allows agency customer developers to write code and manage cloud resources. Many GCP services generate audit logs for customer systems built on those GCP services. The customer audit logs can only be viewed by users/groups with specific Identity and Access Management roles. Customers can configure who can view and export their audit logs within their GCP project or organization.\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for authorizing access to security functions for customer-controlled accounts. The customer control implementation statement should address criteria used to determine which security functions and information require explicit access authorization.",
      "Cloud.gov": "cloud.gov protects all retained logs. Application owned monitoring tools must protect their audit records.\ncloud.gov backs-up all retained logs. Application owned monitoring tools must back-up their audit records.\ncloud.gov manages access to all retained logs. Application owned monitoring tools must manage access to their audit records."
    },
    {
      "Unique Controls": "AC-2(4)",
      "AWS": "The customer is responsible for defining, documenting, approving, and enforcing logical access restrictions associated with changes to their information system built on the AWS infrastructure.\nThe customer is responsible for the following actions concerning their operational systems built on the AWS infrastructure:\na. Employing automated mechanisms to enforce access restrictions and support auditing of the enforcement actions.\nb. Limiting information system developer/integrator privileges to change operating system software and other software installed in their production environment.\nc. Reviewing and reevaluating information system developer & integrator privileges per defined organizational policy (GSA requires at least quarterly).",
      "GCP": "GCP allows agency customer developers to write code and manage cloud resources. GCP retains Google-generated customer audit logs for at least 7 days for free tiered services and no longer than 30 days for premium tiers. It is the customer’s responsibility to offload these audit log records from the GCP Cloud Console and manage the retention of logs. Customers that have longer audit log retention requirements can export logs to Cloud Storage, BigQuery, or Cloud Pub Sub to stream log entries to other applications or repositories.\n \nCustomers are also responsible for the retention of audit records for customer applications within GCP. These end-user logs (\"online logs\") are retained by Google for at least 90 days. Google provides end-user domain administrators with controls over the retention of end-user application audit logs. End-user domain administrators are responsible for preserving audit records offline for a period that is in accordance with NARA.\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for requiring the use of non-privileged accounts/roles when accessing non-security functions for customer-deployed resources. The customer control implementation statement should address the user account/roles that have privileged access to organization-defined security functions and/or security-relevant information, and the requirement that those users leverage non-privileged accounts/roles when accessing non-security functions or information.",
      "Cloud.gov": "cloud.gov inherits its implementation from GSA. The application leveraging cloud.gov will need to inherit the use of their agency's security policy. GSA applications can inherit cloud.gov's implementations."
    },
    {
      "Unique Controls": "AC-2(5)",
      "AWS": "The customer is responsible for establishing, documenting, implementing, monitoring and controlling changes to configuration on their information systems built on the AWS infrastructure. This includes identifying, documenting, and approving exceptions from the mandatory configuration settings for customer instances within their information system. The customer is also responsible for the security configurations of guest operating systems, deployed applications, and configuration control (through automated mechanisms where possible) of select networking resources such as EC2 host firewalls, and VPC internal network configuration.\nAMIs contain standard releases from OS vendors such as Windows Server, RHEL, SUSE Linux and Ubuntu Linux. It is the customer’s responsibility to install the latest security patches after creating instances from these AMIs. The Amazon Linux AMI guest operating system is patched to a point in time, typically quarterly. However, customer responsibility includes updating any instance to a recent patch level and configuring to suit specific needs. AWS does not perform patch management, system hardening, and does not provide any application support within the image.\nUpon deployment of AMIs, the customer assumes full administrator access and is responsible for performing additional configuration, patching, security hardening, vulnerability scanning and application installation, as necessary. AWS will not maintain administrator access to customer EC2 instances, EBS storage or VPCs. Customers are responsible for establishing, documenting, implementing, monitoring, and enforcing the configuration settings on their virtual machines.\nAdditionally the customer is responsible for incorporating a mechanism for the detection of unauthorized, security-relevant configuration changes into the customer’s incident response capability. The customer will also be responsible for controlling personnel/accounts that may change hardware/software and reviewing those privileges periodically.\nThe customer is responsible for:\na. Employing automated mechanisms to centrally manage, apply, and verify configuration settings on the customer instances.\nb. Incorporating detection of unauthorized, security-relevant configuration changes on the customer instances into the customers’ incident response capability to ensure that such detected events are tracked, monitored, corrected, and available for historical purposes",
      "GCP": "Customers are responsible for identifying and authorizing connections to GCP and determining if an ISA is needed for the connections.\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for restricting privileged customer-controlled accounts. The customer control implementation statement should address the personnel/roles which require privileged system access.",
      "Cloud.gov": "The customer is responsible for assessing the security of the system controls defined in this CRM.\nThe customer is responsible for defining the level of independence of security control assessors.\nThe customer is responsible for assessing the security of the system controls defined in this CRM.\nThe customer is responsible for assessing the security of the system controls defined in this CRM."
    },
    {
      "Unique Controls": "AC-2(7)",
      "AWS": "Customers are responsible for implementing least functionality, ensuring that only essential capabilities are used on the customer instances and that they specifically prohibit and/or restrict the use customer-defined/forbidden, ports, protocols, and/or services.\nThe customer is responsible for performing a quarterly review of their customer instances to identify and eliminate unnecessary functions, ports, protocols, and/or services.",
      "GCP": "The customer is responsible for identifying, documenting interface characteristics, security requirements and information communication for each connection established with GCP. \nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for auditing the execution of privileged functions on customer-deployed resources. The customer control implementation statement should address privileged functions and the mechanisms in place to audit their execution.",
      "Cloud.gov": "The customer is responsible for authorizing, documenting, and managing interconnections implemented by their application."
    },
    {
      "Unique Controls": "AC-2(9)",
      "AWS": "The customer is responsible for developing, documenting, and maintaining an inventory of customer instances.\nThe customer is responsible for:\n· Updating the inventory of customer instances as an integral part of instance installation, removal, and information system updates.\n· Employing automated mechanisms to continuously detect the addition of unauthorized customer instances into the information system and disabling network access by such customer instances or notifying designated organizational officials.\n· Verifying that all customer instances within the authorization boundary of the information system, are either inventoried as a part of the system or recognized by another system as a component within that system.",
      "GCP": "The customer is responsible for reviewing and updating Interconnection Security Agreements.\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for ensuring that non-privileged users cannot execute privileged functions on customer-deployed resources. The customer control implementation statement should address the mechanisms in place preventing non-privileged users from executing privileged functions.",
      "Cloud.gov": "The customer is responsible for documenting, tracking and addressing weaknesses discovered in their application."
    },
    {
      "Unique Controls": "AC-20",
      "AWS": "It is the responsibility of AWS customers to manage (and test) the backup and recovery of their information system built on AWS infrastructure. This can be implemented by taking EBS snapshots of the system at organizational defined intervals and storing those using S3 data storage.\nIt is the responsibility of AWS customers to manage (and test) the backup and recovery of their information system built on GovCloud infrastructure. This can be implemented by taking EBS snapshots of the system at organizational defined intervals and storing those using S3 data storage.",
      "GCP": "The customer is responsible for ensuring connections with GCP meet TIC requirements if direct connections are established with unclassified, non-national security systems. \nThere are no customer responsibilities for the GCI since it is not available for public use\"\n\"The customer is responsible for implementing a deny-all, permit by exception policy for connections between applications built on GCP and external applications.\n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for enforcing a limit of consecutive failed login attempts on customer-deployed resources. The customer control implementation statement should address the number of failed login attempts allowed and the time period within which those attempts can occur.",
      "Cloud.gov": "A customer Authorizing Official must explicitly authorize the system for processing."
    },
    {
      "Unique Controls": "AC-20(1)",
      "AWS": "Virtual EC2 instances are completely controlled by the customer agency. Customers have full root access or administrative control over accounts, services, and applications. AWS does not have any access rights to customer instances and cannot log into the guest OS.\nAWS recommends a base set of security best practices to include disabling password-only access to their servers, and utilizing multi-factor authentication to gain access to their instances (or at a minimum certificate-based SSH Version 2 access).\nAdditionally, customers should employ a privilege escalation mechanism with logging on a per-user basis. For example, if the guest OS is Linux, after hardening their instance, they should utilize certificate-based SSHv2 to access the virtual instance, disable remote root login, use command-line logging, and use ‘sudo’ for privilege escalation.\nCustomers should generate their own key pairs in order to guarantee that they are unique, and not shared with other customers or with AWS.\nOnce a customer creates an Amazon EBS volume, the customer can attach it to an Amazon EC2 instance. Once attached, it will appear as a mounted device similar to any hard drive or other block device. At that point, the instance can interact with the volume just as it would with a local drive, formatting it with a file system or installing applications on it directly. The customer controls the EC2 instance an EBS volume may be attached to.\nThrough the AWS Management Console, Amazon Virtual Private Cloud (Amazon VPC) lets customers provision a private, isolated section of the Amazon Web Services (AWS) Cloud where customers can launch AWS resources in the customer-defined virtual network. Customers can leverage multiple layers of security, including security groups and network access control lists, to help control access to Amazon EC2 instances in each subnet.\nAWS Multi-Factor Authentication (AWS MFA) provides an extra level of security that customer agencies apply to their AWS environment. Customer agencies can enable AWS MFA for their account and for individual users they have created under their account. With AWS MFA enabled a user that signs into the FedCloud Console will be prompted for their username and password, as well as for an authentication code from their MFA device. Taken together, these multiple factors provide increased security for customer agencies’ AWS account settings and resources.\nVirtual EC2 instances are completely controlled by the customer agency. Customers have full root access or administrative control over accounts, services, and applications. AWS does not have any access rights to customer instances and cannot log into the guest OS.\nAWS recommends a base set of security best practices to include disabling password-only access to their servers, and utilizing multi-factor authentication to gain access to their instances (or at a minimum certificate-based SSH Version 2 access)\"\n\"Data stored in S3 is secure by default. Only customer agencies have access to the S3 resources they create. S3 supports multiple access control mechanisms and also provides Server Side Encryption (AES-256). \n\nCustomer agencies have the flexibility to control who can access their data as well as how, when, and where they can access it. S3 provides various access control mechanisms: Identity and Access Management (IAM) policies, Access Control Lists (ACLs), bucket policies, and query string authentication. \n\nIAM enables organizations with multiple employees to create and manage multiple users under a single AWS account. With IAM policies, customer agencies can grant IAM users granular control to S3 buckets and objects. \n\nCustomer agencies can use ACLs to selectively add (grant) certain permissions on individual objects. S3 Bucket Policies can be used to add or deny permissions across some or all of the objects within a single bucket. \n\nWith Query string authentication, customer agencies have the ability to share S3 objects through URLs that are valid for a predefined expiration time. \n\nCustomer agencies can securely upload/download data to S3 via the TLS encrypted endpoints using the HTTPS protocol.\"\nMulti-Factor Authentication (MFA) provides an extra level of security that customer agencies apply to their GovCloud environment. Customer agencies should enable MFA for IAM users they have created under their account.",
      "GCP": "Customers are responsible for designating an Authorizing Official (AO) with authority to formally assume responsibility for operating applications built on GCP at an acceptable level of risk. The AO must be a federal employee with the authority to assume risk on behalf of the government. \n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for taking action when a user has reached the number of failed login attempts within the time period documented in AC-07.a. The customer control implementation statement should address which actions the system takes when the requirements of AC-07.a have been exceeded.",
      "Cloud.gov": "Operating systems and DB scans are out of the boundary of application owners. The requirement is bound to the application code and is the responsibility of the application owner.\nThe customer is responsible for defining the level of independence of security control assessors."
    },
    {
      "Unique Controls": "AC-20(2)",
      "AWS": "Customers are responsible for creating and managing compute instances, virtual networks, and block stores. The customer’s list of specific devices and/or types of devices is the list of compute instances, virtual networks, and block stores.\nCustomers are responsible for creating and managing buckets to store objects in S3. The customer’s list of specific devices and/or types of devices is composed of the list of S3 buckets where objects are stored.",
      "GCP": "Following a review of the ATO package, the AOs are required to render a decision authorizing the information system prior to commencing operation. GCI is not available to agencies for direct use. However, agencies have a responsibility to ensure that their AO authorizes all components of the information system for processing before commencing operations. \n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for implementing a compliant system use notification for all customer-deployed resources. The customer control implementation statement should address the content of the notification and the conditions under which it will be displayed. \nFedRAMP Requirement: The customer is responsible for determining which customer-deployed resources require a system use notification. The customer control implementation statement should address the resources that require a system notification. The customer is required to obtain JAB/AO approval of said resources.",
      "Cloud.gov": "The customer is responsible for conducting penetration tests against the application layer of their system.\nThe customer is responsible for defining the level of independence of security control assessors."
    },
    {
      "Unique Controls": "AC-21",
      "AWS": "Customers are responsible for managing all user and device authentication to customer virtual instances within EC2. As such, customers are responsible for defining procedures related to:\na. Receiving authorization from a designated organizational official to assign a user or device identifier\nb. Selecting an identifier that uniquely identifies an individual or device\nc. Assigning the user identifier to the intended party or the device identifier to the intended device\nd. Preventing reuse of user or device identifiers for a defined time period (GSA S/SO or Contractor recommendation to be approved and accepted by the GSA AO)\ne. Disabling the user identifier after a defined time period (GSA requires 90 days for User Level Accounts - GSA S/SO or Contractor recommendation to be approved and accepted by the GSA AO for non-user level accounts (device, token, smart cards, etc).\"\n\"Authentication to customer-stored data within S3 is described in the Customer Responsibility section of IA-2. Authentication to customer data in S3 is managed via the customer’s account. As such, customers are responsible for defining procedures related to: \n- Receiving authorization from a designated organizational official to assign an S3 user account identifier;\"\n- Selecting an identifier that uniquely identifies an S3 individual user account\n- Assigning the S3 user identifier to the intended party\n- Preventing reuse of S3 user accounts identifiers for a predetermined time\n- Disabling the user identifiers after a predetermined time.",
      "GCP": "Customers are responsible for developing and implementing a continuous monitoring strategy for applications built on GCP. This strategy should address Federal and Agency requirements for continuous monitoring. Customers can review Google’s continuous monitoring deliverables that are posted to the Google Services FedRAMP authorization folder on Google Drive monthly.\n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for requiring users to acknowledge the system use notification (described in AC-08.a) on customer-deployed resources. The customer control implementation statement should address the means by which the user will indicate acknowledgment before continuing. \nFedRAMP Requirement: The customer is responsible for providing a mechanism that can periodically verify the system use notification is in place on customer-deployed resources. The customer control implementation statement should address the frequency and process by which the system use notification is verified. The customer is required to obtain JAB/AO approval of the system use notification verification process.",
      "Cloud.gov": "The customer is responsible for authorizing, documenting, and managing internal interconnections implemented by their application."
    },
    {
      "Unique Controls": "AC-22",
      "AWS": "Customer agencies restrict access to their compute instances, virtual networks, and block stores by applying user restrictions to the user account credentials used to access these.\nCustomer agencies restrict access to their objects store in S3 by applying user restriction to the user account credentials used to access their objects.",
      "GCP": "Customers are responsible for developing and implementing a continuous monitoring strategy for applications built on GCP. This strategy should address activities/metrics that meet Federal and Agency requirements for continuous monitoring. Customers can review Google’s continuous monitoring deliverables that are posted to the Google Services FedRAMP authorization folder on Google Drive monthly.\n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for displaying a system use notification on all publicly accessible customer-deployed resources. The customer control implementation statement should address the conditions under which the notification will be displayed. The notification will include (if any) descriptions of monitoring, recording, or auditing that may be configured, and the description of authorized uses of the system.\nFedRAMP Requirement: The customer is responsible for verifying that the system use notification is being displayed as required on customer-deployed resources, either through a configuration baseline check or via other means. The customer control implementation statement should address the verification process of the system use notification. The customer is required to obtain JAB/AO approval of the verification process.",
      "Cloud.gov": "cloud.gov inherits its implementation from GSA. The application leveraging cloud.gov will need to inherit the use of their agency's security policy. GSA applications can inherit cloud.gov's implementations."
    },
    {
      "Unique Controls": "AC-2a",
      "AWS": "Authentication of customer agency users to their virtual machines is outlined in the Customer Agency Authentication Path above under IA-2 and IA-2(1).\nCustomer agencies own and manage authenticators for customer agency users, and should by:\nIA-5(a): Verifying, as part of the initial authenticator distribution, the identity of the individual and/or device receiving the authenticator;\nIA-5(d): Establishing and implementing administrative procedures for initial authenticator distribution, for lost/compromised or damaged authenticators, and for revoking authenticators;\nIA-5(e): Changing default content of authenticators upon information system installation\nIA-5(f): Establishing minimum and maximum lifetime restrictions and reuse conditions for authenticators (if appropriate)\nIA-5(g): Changing/refreshing authenticators at least as often as the GSA-defined parameter (GSA requires 90 days)\nIA-5(h): Protecting authenticator content from unauthorized disclosure and modification\nIA-5(i): Requiring users to take specific measures to safeguard authenticators.\"\n\"Authentication of customer agency users to their objects in S3 is outlined in the Customer Agency Authentication Path above under IA-2 and IA-2(1). \nCustomer agencies own and manage authenticators for customer agency users, and are responsible for: \n- IA-5(a): Verifying, as part of the initial authenticator distribution, the identity of the individual and/or device receiving the authenticator;\"\n- IA-5(d): Establishing and implementing administrative procedures for initial authenticator distribution, for lost/compromised or damaged authenticators, and for revoking authenticators;\n- IA-5(e): Changing default content of authenticators upon information system installation\n- IA-5(f): Establishing minimum and maximum lifetime restrictions and reuse conditions for authenticators (if appropriate)\n- IA-5(g): Changing/refreshing authenticators as required\n- IA-5(h): Protecting authenticator content from unauthorized disclosure and modification\n- IA-5(i): Requiring users to take specific measures to safeguard authenticators.",
      "GCP": "Customers are responsible for developing and implementing a continuous monitoring strategy for applications built on GCP. This strategy should address activities/ metrics that meet Federal and Agency requirements for continuous monitoring. Customers can review Google’s continuous monitoring deliverables that are posted to the Google Services FedRAMP authorization folder on Google Drive monthly.\n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for defining and enforcing the limit of concurrent sessions for each customer-controlled account and/or account type. The customer control implementation statement should address the number of concurrent sessions allowed for each account type.",
      "Cloud.gov": "The application owner is responsible for following software usage restrictions in the application.\nThe application owner is responsible for implementing restrictions for the use of open-source software in the application."
    },
    {
      "Unique Controls": "AC-2b",
      "AWS": "Customers should configure their information systems for password-based authentication so that it:\na. Enforces minimum password complexity of case sensitive characters (GSA requires a minimum of eight characters and must contain a combination of letters, numbers, and special characters).\nb. Enforces at least one changed character when new passwords are created\nc. Encrypts passwords in storage and in transmission\nd. Enforces password minimum and maximum lifetime restrictions (GSA requires one day minimum, 90 day maximum); and\ne. Prohibits password reuse for a predetermined time (GSA requires twenty four generations).\"\n\"Customers should configure their information systems for password-based authentication so that it: \n- Enforces minimum password complexity of case sensitive characters.\"\n- Enforces at least one changed character when new passwords are created\n- Encrypts passwords in storage and in transmission\n- Enforces password minimum and maximum lifetime restrictions\n- Prohibits password reuse for a predetermined time.",
      "GCP": "Customers are responsible for developing and implementing a continuous monitoring strategy for applications built on GCP. This strategy should address activities/metrics that meet Federal and Agency requirements for continuous monitoring. Customers can review Google’s continuous monitoring deliverables that are posted to the Google Services FedRAMP authorization folder on Google Drive monthly.\n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for incorporating a session lock on all customer-deployed resources. The customer control implementation statement should address the period of inactivity and/or user actions resulting in a session lock.",
      "Cloud.gov": "The application owner is responsible for controlling user-installed software in the applications."
    },
    {
      "Unique Controls": "AC-2c",
      "AWS": "Customers that configure their information system for PKI-based authentication, should:\na. Validate certificates by constructing a certification path with status information to an accepted trust anchor\nb. Enforce authorized access to the corresponding private key\nc. Map the authenticated identity to the user account.\"\n\"Customers that configure their information system for PKI-based authentication, should: \n- Validate certificates by constructing a certification path with status information to an accepted trust anchor;\"\n- Enforces authorized access to the corresponding private key\n- Maps the authenticated identity to the user account.",
      "GCP": "Customers are responsible for developing and implementing a continuous monitoring strategy for applications built on GCP. This strategy should address activities/metrics that meet Federal and Agency requirements for continuous monitoring. Customers can review Google’s continuous monitoring deliverables that are posted to the Google Services FedRAMP authorization folder on Google Drive monthly.\n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for retaining the session lock until the user reauthenticates on customer-deployed resources. The customer control implementations statement should address the mechanisms used to reauthenticate a user for a locked session.",
      "Cloud.gov": "Application owners are responsible for the configuration management of their applications. All operating systems, network and DB configurations are outside of the application owner boundary.\nApplication owners are responsible for reviewing and updating the baseline configuration of their applications. All operating systems, network and DB configurations are outside of the application owner boundary.\nApplication owners are responsible for utilizing an automated mechanism to manage the baseline configuration of their applications. All operating systems, network and DB configurations are outside of the application owner boundary.\nApplication owners are responsible for retaining an organizationally-defined number of baseline configurations of their applications to support rollback. All operating systems, network and DB configurations are outside of the application owner boundary.\nApplication owners are responsible for issuing and protecting devices for use in travel for their users."
    },
    {
      "Unique Controls": "AC-2d",
      "AWS": "Customers are responsible for requiring that the registration process to receive HSPD12 smart cards be carried out in person before a designated registration authority with authorization by a designated organizational official (e.g., a supervisor).\nCustomers are responsible for requiring that the registration process to receive HSPD12 smart cards be carried out in person before a designated registration authority with authorization by a designated organizational official (e.g., a supervisor).",
      "GCP": "Customers are responsible for developing and implementing a continuous monitoring strategy for applications built on GCP. This strategy should address activities/metrics that meet Federal and Agency requirements for continuous monitoring. Customers can review Google’s continuous monitoring deliverables that are posted to the Google Services FedRAMP authorization folder on Google Drive monthly.\n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for concealing previously visible information when a session lock is initiated on customer-deployed resources. The customer control implementation statement should address the means by which the displayed information is concealed.",
      "Cloud.gov": "Application owners are responsible for controlling changes to their application."
    },
    {
      "Unique Controls": "AC-2e",
      "AWS": "Customers are responsible for ensuring that critical information, such as privileged credentials, be encrypted in transit and at rest, and that they define requirements for access, access control, access logging and physical control.\nCustomers are responsible for ensuring that critical information, such as privileged credentials, be encrypted in transit and at rest, and that they define requirements for access, access control, access logging and physical control.",
      "GCP": "Customers are responsible for developing and implementing a continuous monitoring strategy that meets Federal and Agency requirements for continuous monitoring. Customers can review Google’s continuous monitoring deliverables that are posted to the Google Services FedRAMP authorization folder on Google Drive monthly.\n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for defining and enforcing events or conditions requiring the termination of a user session on customer-deployed resources. The customer control implementation statement should address the triggering events or conditions in which the system terminates a user session.",
      "Cloud.gov": "Application owners are responsible for assessing the security impact of changes to their application."
    },
    {
      "Unique Controls": "AC-2f",
      "AWS": "Customers are responsible for configuring their web browsers, mobile devices, etc., to enable communications through encryption. In addition, customers are responsible for implementing the Transmission Integrity, Transmission Confidentiality, Use of Cryptography, and Session Authenticity controls for the applications that they establish within their Virtual Machine environments.\nCustomers are responsible for configuring their web browsers, mobile devices, etc., to enable communications through encryption. In addition, customers are responsible for implementing the Transmission Integrity, Transmission Confidentiality, Use of Cryptography, and Session Authenticity controls for the applications that they establish within their S3 and Virtual Machine environments.",
      "GCP": "Customers are responsible for developing, documenting, and maintaining under configuration control the baseline configurations of their GCP information system resources. Customers may elect to use the GCP’s Cloud Deployment Manager which allows customers to develop a repeatable process for creating and managing configuration baselines. \n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for identifying actions that can be performed on the customer-deployed resources without identification or authentication (e.g., such as viewing a publicly accessible web page). The customer control implementation statement should address the process by which the organization identifies the specific actions that can be performed on the customer system without user identification of authentication.",
      "Cloud.gov": "Application owners are responsible for assigning the system-provided org and space roles to their own personnel as appropriate.\nApplication owners are responsible for ensuring that software they deploy to cloud.gov corresponds to the version they approve.\nApplication owners are responsible for reviewing and reevaluating the access granted to their staff via system-provided org and space roles."
    },
    {
      "Unique Controls": "AC-2g",
      "AWS": "See IA-2 and IA-2(1) for the customer’s responsibility regarding agency authentication to their compute resources.\nSee IA-2 and IA-2(1) for the customer’s responsibility regarding authentication to their storage resources.",
      "GCP": "Customers are responsible for developing, documenting, and maintaining under configuration control the baseline configurations of their GCP information system resources. Customers may elect to use the Cloud Deployment Manager which allows customers to develop a repeatable process for creating and managing configuration baselines. Additionally customers will be able to monitor and control changes to the configuration settings.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for providing documentation for user actions not requiring identification or authentication on customer-deployed resources. The customer control implementation statement should address the rationale behind each specific instance of user interaction that does not require identification or authentication.",
      "Cloud.gov": "Application owners are responsible for ensuring the configuration of software that they deploy follows published guidance, or alternative guidance that they have created where necessary.\nApplication owners are responsible for implementing automated controls to verify their intended state. They can use the cloud.gov API, Terraform, etc. to accomplish this."
    },
    {
      "Unique Controls": "AC-2h",
      "AWS": "Incident handling for customer storage, VMs, and applications is the responsibility of the customer unless caused by the AWS or an incident is the result of AWS action. Customers are responsible for providing a point of contact and escalation plan to AWS in order to facilitate communication of statuses of ongoing incidents to government staff. These customer contacts will be documented in the IR plan.\nThe customer is responsible for developing IR plans and testing that includes consideration for any controls deferred to the customer relating to shared touch points included in the AWS authorization boundary and any customer applications leveraging the AWS infrastructure.\"\nIncident handling for customer storage, VMs, and applications is the responsibility of the customer unless caused by the AWS or an incident is the result of AWS action. Customers are responsible for providing a point of contact and escalation plan to AWS in order to facilitate communication of statuses of ongoing incidents to government staff. These customer contacts will be documented in the IR plan.\nThe customer is responsible for developing IR plans and testing that includes consideration for any controls deferred to the customer relating to shared touch points included in the AWS authorization boundary and any customer applications leveraging the GovCloud infrastructure.",
      "GCP": "Customers are responsible for developing, documenting, and maintaining under configuration control the baseline configurations of their GCP information system resources. Customers may elect to use the Cloud Deployment Manager which allows customers to develop a repeatable process for creating and managing configuration baselines. Additionally customers will be able to monitor and control changes to the configuration settings.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for documenting remote access requirements to customer-deployed resources. The customer control implementation statement should address usage restrictions, configuration and connection requirements, and implementation guidance for all remote access types.",
      "Cloud.gov": "Application owners are responsible for following least-functionality principles for the application code that they deploy to cloud.gov.\nApplication owners are responsible for reviewing their deployed applications and disabling unnecessary or insecure functions.\nApplication owners are responsible for ensuring the application does not permit the execution of unauthorized software.\nApplication owners are responsible for ensuring the application does not permit the execution of unauthorized software."
    },
    {
      "Unique Controls": "AC-2i",
      "AWS": "Incident reporting for customer storage, virtual machines, and applications is the responsibility of the customer unless caused by the AWS or an incident is the result of AWS action. Customers are responsible for providing a point of contact and escalation plan to AWS in order to facilitate communication of statuses of ongoing incidents to government staff. These customer contacts will be documented and/or referenced in the IR plan.\nCustomers should work with AWS to develop an agreed upon reporting process and method to receive notification of security incidents involving the potential breach of customer data. Please refer to IR-7 for notification details.\"\nIncident reporting for customer storage, virtual machines, and applications is the responsibility of the customer unless caused by the AWS or an incident is the result of AWS action. Customers are responsible for providing a point of contact and escalation plan to AWS in order to facilitate communication of statuses of ongoing incidents to government staff. These customer contacts will be documented and/or referenced in the IR plan.\nCustomers should work with AWS to develop an agreed upon reporting process and method to receive notification of security incidents involving the potential breach of customer data. Please refer to IR-7 for notification details.",
      "GCP": "Customers are responsible for developing, documenting, and maintaining under configuration control the baseline configurations of their GCP information system resources. Customers may elect to use the Cloud Deployment Manager which allows customers to develop a repeatable process for creating and managing configuration baselines. Additionally customers will be able to monitor and control changes to the configuration settings.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for ensuring all remote access connections to customer-deployed resources are authorized. The customer control implementation statement should address the authorizations established in AC-02.i.",
      "Cloud.gov": "Application owners can use the cloud.gov API, dashboard, and CLI tools to gather authoritative information about the routes, applications, and service instances in use for incorporation into their own documentation and review processes.\nInformation about the routes, applications, and service instance configuration in cloud.gov is updated whenever changes are made. Application owners are responsible for updating their own documentation that refers to this state.\nApplication owners are responsible for identifying unauthorized software running in their orgs and spaces and taking appropriate action.\nCustomer applications are not part of the cloud.gov authorization boundary, so it is the responsibility of the customer to inventory their own applications appropriately."
    },
    {
      "Unique Controls": "AC-2j",
      "AWS": "Customers opting to use the AWS Import/Export services should utilize types of digital media consistent with their organization’s policies. When preparing and/or receiving the media containing their imported/exported data from S3 or EBS, the customer should restrict media access to authorized individuals within their organization and define the appropriate security measures to be used to protect defined media types (i.e. encryption, controlled transport, and sanitization consistent with their organization’s policies.)",
      "GCP": "Customers are responsible for developing, documenting, and maintaining under configuration control the baseline configurations of their GCP information system resources. Customers may elect to use the Cloud Deployment Manager which allows customers to develop a repeatable process for creating and managing configuration baselines. Additionally customers will be able to monitor and control changes to the configuration settings.\n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for monitoring and controlling remote access methods for customer-deployed resources. The customer control implementation statement should address the techniques used to monitor remote connections.",
      "Cloud.gov": "The application owner is responsible for developing and maintaining a configuration management plan for the application."
    },
    {
      "Unique Controls": "AC-2k",
      "AWS": "It is the customer’s responsibility when opting to use AWS Import/Export services to label their media containing their imported/exported data from their S3 bucket or EBS in accordance with their organization’s data classification labels.",
      "GCP": "Customers are responsible for configuring their GCP services to utilize replication and for selecting multiple, geographically diverse regions. This ensures that customer data stored within GCP will be replicated at primary and alternate sites that are geographically separated. \n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for implementing cryptographic mechanisms (e.g., TLS) to protect remote access sessions to customer-deployed resources. The customer control implementation statement should address cryptographic mechanisms used for remote access sessions.",
      "Cloud.gov": "cloud.gov inherits its implementation from GSA. The application leveraging cloud.gov will need to inherit the use of their agency's security policy. GSA applications can inherit cloud.gov's implementations."
    },
    {
      "Unique Controls": "AC-3",
      "AWS": "EBS customers opting to use the AWS Import/Export service must physically control and securely store their digital media of choice containing their data for import/export using a FIPS 140-2 cryptography mechanism. The customer should protect their information system media until the media is destroyed and/or sanitized using approved equipment, techniques, and procedures consistent with their organization’s policies.\nCustomers opting to use the AWS Import/Export services must ensure that their preferred method of media storage is encrypted using a FIPS 140-2 validated encryption.",
      "GCP": "Customers are responsible for configuring their GCP services to utilize replication and for selecting multiple, geographically diverse regions. This ensures that customer processing capabilities within GCP will be replicated at primary and alternate sites that are geographically separated.\n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for routing remote access connections to customer-deployed resources through managed network access control points. The customer control implementation statement should address the number of access control points used to route remote access.",
      "Cloud.gov": "The application owner is responsible for developing a contingency plan that addresses the listed items for the application.\nThe application owner is responsible for coordinating application contingency plan development with other organizational elements responsible for related plans.\nThe application owner is responsible for ensuring sufficient contingency communications capacity exists to support the application during contingency operations.\nThe application owner is responsible for planning the resumption of essential missions and business functions performed by the application.\nThe application owner is responsible for identifying critical assets supporting their application."
    },
    {
      "Unique Controls": "AC-4",
      "AWS": "For EBS customers opting to use the AWS Import/Export service, it is the customer’s responsibility to protect and control their digital media of choice containing their imported/exported EBS region data during transport outside of controlled areas using FIPS 140-2 encryption methods. During transport, the customer needs to maintain accountability for information system media and restrict the activities associated with transport of such media to authorized personnel.\nFor customers opting to use the AWS Import/Export service, they have the responsibility to document the restriction of activities associated with the transport of their imported/exported EBS data and to employ the appropriate encryption method (using a FIPS 140-2 validated cryptography mechanism) of their stored data during transport.",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP, including implementing multifactor authentication for access to privileged customer accounts. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP, including implementing multifactor authentication for access to non-privileged customer accounts. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync. \n\nThere are no customer responsibilities for the GCI since it is not available for public use\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP, including ensuring that customer users are authenticated with an individual authenticator when a group authenticator is employed. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP, including ensuring that replay-resistant authentication mechanisms are used for authentication of users. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP, including ensuring that replay-resistant authentication mechanisms are used for authentication of users. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\n There are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP, including implementing multifactor authentication for customer users and ensuring that the devices used by their multifactor authentication system for access to the Google Cloud is provided by a device separate from the system gaining access and that the device meets FIPS 140-2, NIAP Certification, or NSA approval. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for using multifactor authentication for customer users and ensuring that the devices used by their multifactor authentication system for access to the Google Cloud is provided by a device separate from the system gaining access and that the device meets FIPS 140-2, NIAP Certification, or NSA approval. \n\nThere are no customer responsibilities for the GCI since it is not available for public use\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP, including ensuring that the information system accepts and electronically verifies PIV credentials in their agency authentication systems for customer users. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\n There are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for authorizing privileged commands and access to security-relevant information via remote access for customer-deployed resources. The customer control implementation statement should address the conditions under which privileged commands and access to security-relevant information via remote access may be authorized.",
      "Cloud.gov": "The application owner is responsible for providing contingency training to application personnel."
    },
    {
      "Unique Controls": "AC-4(21)",
      "AWS": "It is the customer’s responsibility when opting to use the AWS Import/Export service to sanitize information system media containing their imported/exported EBS region data prior to disposal, release out of organizational control, or release for reuse. The customer should employ sanitization mechanisms with strength and integrity commensurate with the classification or sensitivity of the information in accordance to their organization’s policy.\nCustomers opting to use the AWS Import/Export service from their EBS region should sanitize media used for the import/export service (media of which is provided by the customer) in accordance to their federal organization’s classification policy and/or federal standards.",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP, including creating user accounts within their own authentication system and for obtaining authorization from the appropriate customer official prior to assigning identifiers to their users. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync. These users will carry over to IAM through the Google Cloud Directory Sync. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for documenting the rationale for executing privileged commands via remote access for customer-deployed resources. The customer control implementation statement should address privileged commands and their operational need, and document the rationale for the execution of privileged commands via remote access in the system security plan (SSP).",
      "Cloud.gov": "The application owner is responsible for testing the contingency plan for the application.\nThe application owner is responsible for coordinating application contingency plan testing with other organizational elements responsible for related plans."
    },
    {
      "Unique Controls": "AC-4(8)",
      "AWS": "AWS operates under a model of shared responsibility between the customer and AWS. AWS provides AMIs for client VMs that, after instantiation, are fully the customer agency’s’ responsibility. These default images are not included in vulnerability scanning activities conducted by AWS. Additionally, AWS will not maintain administrator access to customer VMs.\nUpon deployment of virtual machines, the customer assumes full administrator access and is responsible for performing additional application installation, configuration, patching, security hardening, operating system vulnerability scanning, web application vulnerability scanning, and database vulnerability scanning (as applicable) for assets with which they have implementation responsibility (above the hypervisor, within each instance) as necessary. Customer management of the security of their operating environment as well as conducting vulnerability scans and pen-tests shall be conducted in accordance with their own Risk Assessment, the AWS Acceptable Use Policy, and the AWS Vulnerability / Penetration Testing Request Form.\nCustomers that want to conduct vulnerability scans and pen-tests of their operating environment must first contact AWS for permission To do so, AWS uses a web form to collect the information necessary to review security audit requests. In order to begin the authorization process, please visit the following AWS site: http://aws.amazon.com/security/penetration-testing/\nAt the site, the customer selects the \"\"AWS Vulnerability / Penetration Testing Request Form\"\" link and completes the form as requested. This form also includes the AWS Terms and Policies with regard to testing. Once the form is completed and received by AWS, the authorization review process is conducted and normally takes 1-2 business days to complete.\"\n\"AWS operates under a model of shared responsibility between the customer and AWS. Upon deployment of S3 storage, the customer assumes full administrator access and is responsible for performing additional vulnerability scanning, web application vulnerability scanning, and database vulnerability scanning (as applicable) for assets with which they have implementation responsibility (above the hypervisor, within each instance) as necessary. Customer management of the security of their operating environment as well as conducting vulnerability scans and pen-tests shall be conducted in accordance with their own Risk Assessment, the AWS Acceptable Use Policy, and the AWS Vulnerability / Penetration Testing Request Form. \n\nCustomers that want to conduct vulnerability scans and pen-tests of their operating environment must first contact AWS for permission to do so, AWS uses a web form to collect the information necessary to review security audit requests. In order to begin the authorization process, please visit the following AWS site: http://aws.amazon.com/security/penetration-testing/ \n\nAt the site, the customer selects the AWS Vulnerability Penetration Testing Request Form link and completes the form as requested. This form also includes the AWS Terms and Policies with regard to testing. Once the form is completed and received by AWS, the authorization review process is conducted and normally takes 1-2 business days to complete.",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP, including creating user accounts within their own authentication system and selecting identifiers to identify customer users. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync. These users will carry over to IAM through the Google Cloud Directory Sync. \n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for ensuring the customer-deployed system has the capability to rapidly disconnect or disable remote access. The customer control implementation statement should address the mechanisms used to disconnect remote access sessions and/or disable remote access, and the timeframe within which it must occur.",
      "Cloud.gov": "Application owners must ensure the services and SLAs offered by cloud.gov meet their operational needs. cloud.gov is responsible for the underlying system availability to meet the SLAs.\nApplication owners must ensure the services and SLAs offered by cloud.gov meet their operational needs. cloud.gov is responsible for the underlying system availability to meet the SLAs.\nApplication owners must ensure the services and SLAs offered by cloud.gov meet their operational needs. cloud.gov is responsible for the underlying system availability to meet the SLAs."
    },
    {
      "Unique Controls": "AC-5",
      "AWS": "Customers are responsible for using AWS-provided guest operating systems, software and associated documentation in accordance with contract agreements and copyright laws. In addition, customers are responsible for implementing the Software Usage Restrictions control for the applications that the customer establishes within their Virtual Machine environments.",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP, including creating user accounts within their own authentication system and assigning identifiers to intended individual customer users. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync. These users will carry over to IAM through the Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for establishing terms and conditions allowing authorized individuals to access the customer-deployed resources from external information systems. The customer control implementation statement should address the terms and conditions for access and the external information systems to which those terms and conditions apply.",
      "Cloud.gov": "cloud.gov distributes customer workloads across availability zones. Application owners are responsible for ensuring multiple instances of their application are running in order to take advantage of multiple availability zones.\ncloud.gov distributes customer workloads across availability zones. Application owners are responsible for ensuring multiple instances of their application are running in order to take advantage of multiple availability zones.\nApplication owners are responsible for ensuring they're able to access their applications in the event of a disaster.\nApplication owners must ensure the services and SLAs offered by cloud.gov meet their operational needs. cloud.gov is responsible for the underlying system availability to meet the SLAs."
    },
    {
      "Unique Controls": "AC-6",
      "AWS": "Customers are responsible for establishing and managing cryptographic keys for required cryptography employed within their information system\nCustomers are responsible for establishing and managing cryptographic keys for required cryptography employed within their information system.",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP, including creating user accounts within their own authentication system and controlling the re-use of identifiers for customer users. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync. These users will carry over to IAM through the Google Cloud Directory Sync. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for establishing terms and conditions allowing authorized individuals to process, store, or transmit customer-controlled information using external information systems. The customer control implementation statement should address the terms and conditions for use of customer-controlled information and the external information systems to which those terms and conditions apply.",
      "Cloud.gov": "cloud.gov maintains storage backups for 14 days to facilitate disaster recovery. Application owners are responsible for taking backups at non-emergency intervals that are meaningful for their application.\ncloud.gov maintains storage backups for 14 days to facilitate disaster recovery. Application owners are responsible for verifying they can restore their own backups at non-emergency intervals that are meaningful for their application.\nApplication owners are responsible for ensuring that their application code and compliance materials are available from a source other than cloud.gov."
    },
    {
      "Unique Controls": "AC-6(1)",
      "AWS": "Customers are responsible for configuring their web browsers, mobile devices, etc., to enable communications through encryption. In addition, customers are responsible for implementing the Transmission Integrity, Transmission Confidentiality, Use of Cryptography, and Session Authenticity controls for the applications that customers establish within their Virtual Machine environments.",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP, including creating user accounts within their own authentication system and managing inactive identifiers for customer users. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for establishing terms and conditions for external systems accessing, processing, storing or transmitting organization-defined information from customer-deployed resources. The customer control implementation statement should address the external organization, the corresponding connection or processing agreement, and how the external systems connecting to customer-deployed resources are verified as adhering to the required security controls.",
      "Cloud.gov": "cloud.gov inherits its implementation from GSA. The application leveraging cloud.gov will need to inherit the use of their agency's security policy. GSA applications can inherit cloud.gov's implementations."
    },
    {
      "Unique Controls": "AC-6(10)",
      "AWS": "Customers are responsible for ensuring the information system provides mechanisms to protect the authenticity of communications sessions.\nCustomers are responsible for ensuring the information system provides mechanisms to protect the authenticity of communications sessions.",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP, including managing Customer user IDs in a manner that uniquely identifies contractors and US citizenship status data for customer users. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for determining when authorized users are required to use discretion as to whether to share customer-controlled information. The customer control implementation statement should address the circumstances where user discretion is required.",
      "Cloud.gov": "Application owners are responsible for implementing a MFA solution for access to their systems and resources. cloud.gov supports customers in leveraging cloud.gov's MFA-enabled authentication system to authenticate government users.\nApplication owners are responsible for implementing a MFA solution for access to their systems and resources. cloud.gov supports customers in leveraging cloud.gov's MFA-enabled authentication system to authenticate government users.\nApplication owners are responsible for implementing a MFA solution for access to their systems and resources. cloud.gov supports customers in leveraging cloud.gov's MFA-enabled authentication system to authenticate government users.\nApplication owners are responsible for providing a PIV-enabled MFA solution for access to their systems and resources. cloud.gov configures login.gov to act as a PIV-enabled MFA solution for customers who request it.\nApplication owners are responsible for implementing a MFA solution for access to their systems and resources. cloud.gov supports customers in leveraging cloud.gov's MFA-enabled authentication system to authenticate government users.\nApplication owners are responsible for implementing a MFA solution for access to their systems and resources. cloud.gov supports customers in leveraging cloud.gov's MFA-enabled authentication system to authenticate government users.\nApplication owners are responsible for ensuring that individuals are authenticated in their systems and resources when a group authenticator is used.\nApplication owners are responsible for implementing a MFA solution for access to their systems and resources. cloud.gov supports customers in leveraging cloud.gov's MFA-enabled authentication system to authenticate government users."
    },
    {
      "Unique Controls": "AC-6(2)",
      "AWS": "Customers have complete control over their compute instances, virtual networks, and block stores in EC2, VPC, and EBS, respectively. Customers should configure their compute instances and block stores to protect the confidentiality and integrity of their information at rest.\nCustomers are responsible for encrypting their data prior to uploading to S3. Customer agencies may consider using S3 Server Side Encryption (SSE) as outlined above in order to protect their data at rest in S3.",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for verifying the identity of customer users as part of their initial authenticator distribution process.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for employing a process to assist users with making information sharing decisions (see AC-21.a). The customer control implementation statement should address the process used to assist customers with these decisions.",
      "Cloud.gov": "Application owners are responsible for uniquely identifying and authenticating devices before establishing connections."
    },
    {
      "Unique Controls": "AC-6(5)",
      "AWS": "Customers are responsible for setting up, configuring and managing their computer systems into virtual private networks (VPCs) that partitions their information system into components residing in separate virtual domains (or environments) as deemed necessary.\nCustomer agencies are responsible for setting up, configuring and managing their computer systems into virtual private networks (VPCs) that partitions their information system into components residing in separate virtual domains (or environments) as deemed necessary.",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for establishing initial authenticator content for customer user accounts.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for designating authorized personnel to post publicly accessible information on customer-deployed resources. The customer control implementation statement should address the personnel authorized to post publicly available content.",
      "Cloud.gov": "For customers who do not use the cloud.gov fallback identity provider, cloud.gov delegates authentication to the customer-provided identity system. It is the responsibility of the customer to provide all relevant authorizations, both “to” and “within” cloud.\n\"Customers are responsible for uniquely identifying the contractor and/or foreign national status of each user who has a role in their org or space (see Types of Users table). \n\nFor customers who do not use the cloud.gov identity provider, cloud.gov delegates the responsibility of customer identity management to the customer-provided identity system."
    },
    {
      "Unique Controls": "AC-6(8)",
      "AWS": "Customer agencies are responsible for configuring their storage and compute resources within AWS to prevent unauthorized and unintended information transfer via shared system resources.\nCustomers are responsible for configuring their storage and compute resources within AWS to prevent unauthorized and unintended information transfer via shared system resources.",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for ensuring that authenticators meet customer authenticator strength requirements.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for training the personnel defined in AC-21.a to prevent disclosure of nonpublic customer-controlled information. The customer control implementation statement should address the training provided.",
      "Cloud.gov": "For customers who do not use the cloud.gov fallback identity provider, cloud.gov delegates customer identity verification and authenticator management to the customer-provided identity system. It is the responsibility of that system to establish identity. \nWhen those systems return identity assertions to cloud.gov, the assertions are required to be encrypted and signed by the customer-provided identity system.\"\nApplication owners are responsible for password complexity policies for their systems and resources.\nFor customers who do not use the cloud.gov fallback identity provider, cloud.gov is not responsible for hardware tokens, as it delegates authentication to customer-provided identity system. It is the responsibility of those systems to implement support for hardware tokens, if applicable.\nApplication owners are responsible for PKI-based authentication processes for their systems and resources.\nApplication owners are responsible for authenticator management processes for their systems and resources.\nApplication owners are responsible for ensuring authenticators are sufficiently strong for their systems and resources.\nApplication owners are responsible for ensuring authenticators are sufficiently protected for their systems and resources.\nApplication owners are responsible for ensuring authenticators are not embedded or stored in vulnerable locations."
    },
    {
      "Unique Controls": "AC-6(9)",
      "AWS": "Customer agencies are responsible for maintaining host-based firewall on compute instances in order to protect against malicious communications at the external boundary of the system. In addition, where the customer agencies have established key internal boundaries within the system, the customer agency is responsible for the setup and configuration of their VPC in order to enforce communications rules between internal networks.\nCustomers may set up and configure a VPC in order to virtually allocate publicly accessible information system components to separate sub-networks with separate physical network interfaces.\nVPC also provides customer agencies with an IPsec VPN. IPsec VPN is an IPsec VPN connection connects a customer’s VPC to another network designated by the customer. IPsec is a protocol suite for securing Internet Protocol (IP) communications by authenticating and encrypting each IP packet of a data stream. Amazon VPC customers can create an IPsec VPN connection to their VPC by first establishing an Internet Key Exchange (IKE) security association between their Amazon VPC VPN gateway and another network gateway using a pre-shared key as the authenticator.\nUpon establishment, IKE negotiates an ephemeral key to secure future IKE messages. Proper establishment of an IKE security association requires complete agreement among the parameters, including SHA-1 authentication and AES 128-bit encryption. Next, using the IKE ephemeral key, keys are established between the VPN gateway and customer gateway to form an IPsec security association. Traffic between gateways is encrypted and decrypted using this security association. IKE automatically rotates the ephemeral keys used to encrypt traffic within the IPsec security association on a regular basis to ensure confidentiality of communications.",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for establishing and implementing procedures for the distribution, loss, and revoking of customer users’ authenticators.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for reviewing proposed content of customer-controlled information prior to posting publicly to ensure nonpublic information is not included. The customer control implementation statement should address the review process.",
      "Cloud.gov": "Application owners are responsible for ensuring authentication information is obscured during the authentication process for their systems and resources."
    },
    {
      "Unique Controls": "AC-7",
      "AWS": "Customers are responsible for configuring their web browsers, mobile devices, etc., to enable communications through encryption. In addition, customers are responsible for implementing the Transmission Integrity, Transmission Confidentiality, Use of Cryptography, and Session Authenticity controls for the applications that customers establish within their storage and virtual machine environments.\nCustomers are responsible for configuring their web browsers, mobile devices, etc., to enable communications through encryption. In addition, customers are responsible for implementing the Transmission Integrity, Transmission Confidentiality, Use of Cryptography, and Session Authenticity controls for the applications that customers establish within their storage and virtual machine environments.",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for establishing minimum and maximum lifetime and reuse conditions for customer authenticators. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for periodically reviewing publicly available customer-controlled content for nonpublic information. The customer control implementation statement should address the frequency of the review and the removal of nonpublic information, if discovered.",
      "Cloud.gov": "Application owners are responsible for ensuring requirements for authentication to a cryptographic modules meet all appropriate laws and regulations for their systems and resources."
    },
    {
      "Unique Controls": "AC-7(2)",
      "AWS": "Customers using the AWS EBS offering should develop a policy identifying acceptable data types to be stored. The customer is also responsible for defining field types, creating input validation rules for specific objects, as well as configuring any input restrictions and conducting any validity checks required on the information they place into the storage environment. In addition, the customer is responsible for ensuring only authorized individuals are designated as administrators within the management portal.\nCustomers using the S3 storage offering should develop a policy identifying acceptable data types to be stored. The customer is also responsible for defining field types, creating input validation rules for specific objects, as well as configuring any input restrictions and conducting any validity checks required on the information they place into the storage environment. In addition, the customer is responsible for ensuring only authorized individuals are designated as administrators.",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP, including refreshing and changing customer authenticators. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for developing, documenting, reviewing, updating, and disseminating security awareness training policy and procedures. The customer security awareness training addresses the security around the customer-deployed resources for the customer’s users. The customer control implementation statement should address the content of the policy (which must include purpose, scope, roles, responsibilities, management commitment, coordination, and compliance), procedures (which must facilitate the implementation of the policies and associated controls), the frequency of review, and the role(s) responsible.",
      "Cloud.gov": "Application owners are responsible for uniquely identifying and authenticating non-organizational users for their systems and resources.\nApplication owners are responsible for accepting and verifying PIV credentials from other federal agencies for their systems and resources.\nApplication owners are responsible for accepting only FICAM-approved third-party credentials for their systems and resources.\nApplication owners are responsible for using only FICAM-approved components to accept third-party credentials for their systems and resources.\nApplication owners are responsible for FICAM-conformance of their systems and resources."
    },
    {
      "Unique Controls": "AC-8",
      "AWS": "Customers are responsible for performing operating system vulnerability scanning, web application, and database scanning (as applicable) for assets for which they have implementation responsibility (above the hypervisor). AWS provides Amazon Machine Images (AMIs) for client Virtual Machines (VMs) that after instantiation are fully the customer agencies responsibility. Upon deployment of virtual machines, the customer assumes full administrator access and is responsible for performing additional configuration, patching, security hardening, vulnerability scanning and application installation, as necessary. AWS will not maintain administrator access to customer VMs. These default images are not included in vulnerability scanning activities conduct by AWS or its Approved Scanning Vendor (ASV).\nCustomers are responsible for performing operating system vulnerability scanning, web application, and database scanning (as applicable) for assets for which they have implementation responsibility (above the hypervisor).",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP, including protecting customer authenticator content from unauthorized disclosure and modification. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for providing basic security awareness training to all users of customer-deployed resources as part of initial training. The customer control implementation statement should address the content of the training and the process for ensuring all users undergo the initial described training.",
      "Cloud.gov": "cloud.gov inherits its implementation from GSA. The application leveraging cloud.gov will need to inherit the use of their agency's security policy. GSA applications can inherit cloud.gov's implementations."
    },
    {
      "Unique Controls": "AC-8a",
      "AWS": "Customers are responsible for installing, configuring, and maintaining anti-virus and malicious code protection on their virtual machines and related applications. Customers should centrally manages malicious code protection mechanisms and configure automatic updates including signature definitions. Customers should also ensure the information system prevents non-privileged users from circumventing malicious code protection capabilities.",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP, including requiring users, and having devices implement, specific security safeguards to protect authenticators. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for providing updated basic security awareness training to all users when required by changes to customer-deployed resources. The customer control implementation statement should address the system changes that require updated training and the process which ensures all employees receive retraining.",
      "Cloud.gov": "The application owner is responsible for training users in their incident response responsibilities for the application."
    },
    {
      "Unique Controls": "AC-8b",
      "AWS": "FALSE",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP, including changing authenticators for group accounts when membership to those accounts changes. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for providing ongoing, periodic basic security awareness training to all users. The customer control implementation statement should address the frequency at which retraining will occur and the process which ensures all employees receive retraining.",
      "Cloud.gov": "The application owner is responsible for testing the incident response for the application.\nThe application owner is responsible for coordinating testing of the incident response for the application with related organizational elements."
    },
    {
      "Unique Controls": "AC-8c",
      "AWS": "The customer is responsible for monitoring and detecting unauthorized changes to software and information within their information system as well as assessing the integrity of software and information by performing integrity scans of the information system at least quarterly",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP, including enforcing a minimum password complexity for password based authentication. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP, including ensuring that at least one character has changed when new passwords are created. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP, including ensuring that passwords are cryptographically protected in storage and transmission. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP, including enforcing password minimum and maximum lifetime restrictions for user passwords. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP, including ensuring that customer passwords are not reused for 24 generations. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP. This includes, if temporary passwords are used in the customer system, issuing temporary passwords for system logons with an immediate change to a permanent password. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for the management of customer PKI infrastructure and authentication in their systems. This includes validating certificates by constructing and verifying the certification path to an accepted trust anchor. Customers may elect to use the Cloud Key Management Service (Cloud KMS) within the GCP Identity & Security product family to help address this requirement. Cloud KMS is a cloud-hosted key management service that allows customers to manage encryption for their cloud services. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for the management of customer PKI infrastructure and authentication in their systems. This includes enforcing authorized access to customer private keys. Customers can use the Cloud Key Management Service to help manage customer keys.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for the management of customer PKI infrastructure and authentication in their systems. This includes mapping authenticated identities of customer identifiers to customer individuals or groups. Customers can use the Cloud Key Management Service to help manage customer keys.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for the management of customer PKI infrastructure and authentication in their systems. This includes implementing a local cache of revocation data for user PKI. Customers can use the Cloud Key Management Service to help manage customer keys.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for the registration process for customer users to receive multifactor authenticators. This includes authorization by the appropriate role, to be conducted in person by the appropriate personnel.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP, including employing automated tools to determine if password authenticators for customer user accounts meet customer requirements. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP, including protecting customer authenticators commensurate with the security category of the information that they permit access to. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for ensuring that static authenticators are not embedded in customer applications, access scripts or stored on function keys.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP, including implementing different authenticators on different systems. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP, including employing hardware tokens that satisfy customer requirements. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP, including prohibiting the use of cached customer authenticators after a defined period. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for providing training on insider threats. The customer control implementation statement should address the indicators of insider threats, and the process of recognizing and reporting them.",
      "Cloud.gov": "Application owners must define events and SLAs for the detection and reporting of suspicious activities. The application owner must have their own procedures and processes in place to respond to all reported incidents.\nThe application owner is responsible for employing automated mechanisms to support the application incident handling process."
    },
    {
      "Unique Controls": "AT-1",
      "AWS": "The customer is responsible for restricting the capability to input information to the information system to authorized personnel.",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP, including ensuring that at least one character has changed when new passwords are created. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for providing role-based security training to users before authorizing access to customer-deployed resources or performing assigned duties. The customer control implementation statement should address the content of the training for each identified role, and the process for ensuring all identified roles receive training prior to accessing the system or performing assigned duties.",
      "Cloud.gov": "cloud.gov provides documentation related to incidents that have been captured in the system logs and monitoring tools upon request. Application owners must have their own system for collecting and tracking incident information."
    },
    {
      "Unique Controls": "AT-2",
      "AWS": "Customers are responsible for restricting the capability to input information to the information system to authorized personnel.",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP, including ensuring that authenticator feedback is obscured during the customer authentication process. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for providing role-based security training to all identified roles when required by changes to customer-deployed resources. The customer control implementation statement should address the system changes that require updated training and the process which ensures all employees receive retraining.",
      "Cloud.gov": "The application owner must ensure incidents are appropriately reported for the application.\ncloud.gov trouble/incident tickets can help the application owner in being alerted however application owners must have their own reporting systems in place."
    },
    {
      "Unique Controls": "AT-2(2)",
      "AWS": "",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nCustomers are responsible for implementing mechanisms for authentication that meet all applicable requirements for such authentication. Additionally, customers are required to ensure that customer machines connecting to Google Cloud are configured to use appropriate encryption for Google-to-agency communications. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for providing ongoing, periodic role-based security training to all identified roles. The customer control implementation statement should address the frequency at which retraining will occur and the process which ensures all employees receive retraining.",
      "Cloud.gov": "The application owner is responsible for identifying a point of contact for interfacing with the cloud.gov incident response team.\nThe application owner must have their own system in place for reporting and establish SLAs with cloud.gov to ensure incident information.\nThe application owner is responsible for identifying a point of contact for interfacing with the cloud.gov team during incident response."
    },
    {
      "Unique Controls": "AT-3",
      "AWS": "",
      "GCP": "Customers are responsible for managing all aspects of authentication for customer users of GCP. This includes uniquely identifying and authenticating non-organizational customer users (or processes acting on behalf of non-organizational customer users). This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP, including accepting and electronically verifying PIV credentials in their agency authentication systems for customer users. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP. This includes accepting only FICAM-approved third party credentials in their agency authentication systems for customer users. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP. This includes employing only FICAM-approved system components to accept third party credentials in their agency authentication systems for customer users. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing all aspects of authentication for customer users of GCP. This includes conforming to FICAM-issued profiles in their agency authentication systems for customer users. This may be achieved by using a customer managed SAML-based Single Sign-On system and synchronizing this system with GCP via Google Cloud Directory Sync. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for documenting and monitoring all system security training activities for customer-deployed resources. The customer control implementation statement should address the process used to monitor and document training.",
      "Cloud.gov": "The application owner is responsible for developing an IRP for their application that includes documenting their expected interaction with cloud.gov."
    },
    {
      "Unique Controls": "AT-4",
      "AWS": "",
      "GCP": "The customer is responsible for notifying US-CERT when suspected incidents of PII or Data breach is detected within products and applications built using GCP. Agency customers are the data owners, responsible for understanding the data they put into Google Services and the first responder for all potential incidents related to domain access provisions and file access. The customer is responsible for notifying US-CERT within one (1) hour of suspected incident involving PII or data breach. \n\nIt is the customer's responsibility to provide the correct and up-to-date contact information in the Google Cloud Console. Google will send notification email to Customer following the discovery of security breach.\n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for retaining individual training records for users of customer-deployed resources. The customer control implementation statement should address the retention period for individual training records.",
      "Cloud.gov": "The application owner is responsible for ensuring system personnel respond appropriately in response to information spillage in the customer application.\nThe application owner is responsible for information spillage response for the application.\nThe application owner is responsible for information spillage response for the application.\nThe application owner is responsible for information spillage response for the application.\nThe application owner is responsible for information spillage response for the application."
    },
    {
      "Unique Controls": "AU-1",
      "AWS": "",
      "GCP": "Customers are responsible for reporting security incident information to US-CERT when suspected incidents of PII exposure or data breach are detected within products and applications built using GCP. As data owners, customer agencies are responsible for understanding the data they put into Google Services and are the first responder for all potential incidents related to domain access provisions and file access.\n\nIt is the customer's responsibility to provide the correct and up-to-date contact information in the Google Cloud Console. Google will send notification email to Customer following the discovery of security breach.\n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for developing, documenting, reviewing, updating, and disseminating audit and accountability policy and procedures. These documents should address the auditing and accountability of the customer-deployed system. The customer control implementation statement should address the content of the policy (which must include purpose, scope, roles, responsibilities, management commitment, coordination, and compliance), procedures (which must facilitate the implementation of the policies and associated controls), the frequency of review, and the role(s) responsible.",
      "Cloud.gov": "cloud.gov inherits its implementation from GSA. The application leveraging cloud.gov will need to inherit the use of their agency's security policy. GSA applications can inherit cloud.gov's implementations."
    },
    {
      "Unique Controls": "AU-11",
      "AWS": "",
      "GCP": "The customer is responsible for classifying data, and determining the data classification requirements of applications built using GCP. Google is not privy to the classification of the customer data in GCP, and therefore cannot determine when customer data has been spilled. The customer is responsible for developing and implementing procedures for reporting and handling information spillage.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for ensuring the system is capable of auditing customer-defined events for customer-deployed resources (to include applications, operating systems, databases, and software). The customer control implementation statement should address the identified events and the system's capability to audit them.",
      "Cloud.gov": "cloud.gov inherits its implementation from GSA. The application leveraging cloud.gov will need to inherit the use of their agency's security policy. GSA applications can inherit cloud.gov's implementations."
    },
    {
      "Unique Controls": "AU-12",
      "AWS": "",
      "GCP": "The customer is responsible for classifying data and determining the data classification requirements of applications built using GCP. Google is not privy to the classification of the customer data in GCP, and therefore cannot determine when customer data has been spilled. The customer is responsible for developing and implementing procedures for reporting and handling information spillage.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for coordinating with other entities within its organization to guide the selection of auditable events for customer-deployed resources. The customer control implementation statement should address the customer's organizational entities that provide input to the selection of auditable events and the process by which auditable event selection is coordinated.",
      "Cloud.gov": "cloud.gov inherits its implementation from GSA. The application leveraging cloud.gov will need to inherit the use of their agency's security policy. GSA applications can inherit cloud.gov's implementations."
    },
    {
      "Unique Controls": "AU-2",
      "AWS": "",
      "GCP": "The customer is responsible for identifying and isolating contaminated system components for further review or eradication. Customers electing to change access rights in order to isolate components should use the customer managed SAML-based SIngle SIgn-On system as discussed on AC-2.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for ensuring the list of auditable events supports after-the-fact investigations of customer-deployed resources. The customer control implementation statement should address the rationale for why the auditable events defined in AU-02.a are adequate to support after-the-fact investigations.",
      "Cloud.gov": "cloud.gov inherits its implementation from GSA. The application leveraging cloud.gov will need to inherit the use of their agency's security policy. GSA applications can inherit cloud.gov's implementations."
    },
    {
      "Unique Controls": "AU-2(3)",
      "AWS": "",
      "GCP": "The customer is responsible for developing and executing a plan to eradicate data from components that are affected by information spills. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "TRUE",
      "Cloud.gov": "The application owner is responsible for developing an SSP that addresses the security controls implemented by the application.\nThe application owner is responsible for coordinating security activities with defined personnel to reduce the impact of those activities."
    },
    {
      "Unique Controls": "AU-2(4)",
      "AWS": "",
      "GCP": "The customer is responsible for identifying and isolating contaminated system components for further review or eradication. Customers electing to change access rights in order to isolate components should use the customer managed SAML-based SIngle SIgn-On system as discussed on AC-2. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "TRUE",
      "Cloud.gov": "The application owner is responsible for ensuring rules of behavior are developed and enforced for the application.\nThe application owner is responsible for ensuring rules of behavior for the application address the use of social media."
    },
    {
      "Unique Controls": "AU-3",
      "AWS": "",
      "GCP": "The customer is responsible for handling information spills in accordance with their agency defined policies and procedures. The customer may choose to contact the GCP support team for additional assistance when deemed necessary.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for configuring Azure auditing capabilities on customer-deployed (to include applications, operating systems, databases, and software) resources to generate audit records. The customer control implementation statement should address the requirement that audit records contain the following: what type of event occurred, when the event occurred, where the event occurred, the source of the event, the outcome of the event and the identity of any subjects associated with the event.",
      "Cloud.gov": "The application owner is responsible for the information security architecture of their application."
    },
    {
      "Unique Controls": "AU-3(1)",
      "AWS": "",
      "GCP": "The customer is responsible for ensuring that the appropriate Incident Response personnel are notified once a possible incident has been detected. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"The customer is responsible for providing training on procedures for identifying, reporting and handling information spills. The customer is also responsible for providing training to designated Incident Response personnel on how to respond and manage information spills.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"The customer is responsible for implementing procedures to limit further contamination while contaminated systems undergo corrective actions.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"The customer is responsible for employing organizational-defined safeguards for personnel exposed to information not within assigned access authorizations. The customer is responsible for educating it’s personnel on the different data types and the stipulated restrictions in sharing the different data types.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for configuring Azure auditing capabilities on customer-deployed resources to ensure organizational audit record content requirements are implemented. The customer control implementation statement should address customer-defined details required in audit records in addition to the contents specified in AU-03.",
      "Cloud.gov": "cloud.gov inherits its implementation from GSA. The application leveraging cloud.gov will need to inherit the use of their agency's security policy. GSA applications can inherit cloud.gov's implementations."
    },
    {
      "Unique Controls": "AU-4",
      "AWS": "",
      "GCP": "Customers are responsible for identifying risk designations for all positions that will have access to US government data or support systems that contain government data. Customers should review relevant Human Resources, Personnel Security, or Information Security policies prior to assigning a risk designation.\n\nCustomers should separately categorize their data in agreement with FIPS 199 and NIST SP 800-60 Rev. 1 (Guide for Mapping Types of Information and Information Systems to Security Categories, August 2008) to ensure that the security category of information types collected, processed, or stored in the Google-provided infrastructure does not exceed Moderate impact for confidentiality, integrity, and/or availability.\n\nGovernment/FedRAMP customers who subscribe to Google Cloud Platform’s available paid support offerings (as of July 2017, Silver, Gold or Platinum account-based support, and paid Support roles via the role-based support model launching in late 2017) will always have access to support personnel who are cleared through the Google FedRAMP Enhanced Background Check Process. Other customers do not have access to support personnel directly.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for allocating audit record storage capacity for customer-deployed resources (to include applications, operating systems, databases, and software). The customer control implementation statement should address the audit record storage requirements. Additionally, the customer should consider the retention period defined in AU-11 when allocating storage capacity for audit records.",
      "Cloud.gov": "The application owner is responsible for establishing and executing screening requirements for application staff."
    },
    {
      "Unique Controls": "AU-5",
      "AWS": "",
      "GCP": "Customers are responsible for identifying screening requirements for all positions that will have access to US government data or support systems that contain US government data. Customers should review relevant policies prior to determining the screening requirement.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for providing alerts in response to audit processing failures (e.g., storage quota is reached, audit hardware/software errors) of customer-deployed resources(to include applications, operating systems, databases, and software). The customer control implementation statement should address the personnel/roles to be notified when audit processing failures occur.",
      "Cloud.gov": "The application owner is responsible for ensuring application personnel are screened prior to being authorized to access the application.\nApplication owners must ensure that application personnel have valid access authorization for any application information requiring special protection."
    },
    {
      "Unique Controls": "AU-6",
      "AWS": "",
      "GCP": "Customers are responsible for reviewing and revising position risk designations annually. If changes to position risk decisions should occur, customers should follow their Agency guidance for rescreening employees with access to customer data.\n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "TRUE",
      "Cloud.gov": "The application owner is responsible for ensuring termination policies and procedures are enforced against application users when appropriate."
    },
    {
      "Unique Controls": "AU-6(1)",
      "AWS": "",
      "GCP": "Customers are responsible for ensuring that employees pass background checks prior to authorizing access to GCP and systems built using GCP in accordance with Customer Agency screening requirements. \n \nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "TRUE",
      "Cloud.gov": "The application owner is responsible for ensuring transfer policies and procedures are enforced against application users when appropriate."
    },
    {
      "Unique Controls": "AU-6(3)",
      "AWS": "",
      "GCP": "Customers are responsible for rescreening employees that that have access to GCP and systems built using GCP in accordance with Customer Agency screening requirements. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for reporting findings of inappropriate or unusual activity (defined in AU-06.a) on customer-deployed resources. The customer control implementation statement should address which personnel/roles will be notified of any findings.",
      "Cloud.gov": "The application owner is responsible for developing and implementing access agreements with application personnel."
    },
    {
      "Unique Controls": "AU-7",
      "AWS": "",
      "GCP": "Customers are responsible for ensuring that users have assigned official government duties and the appropriate access authorizations prior to accessing GCP and systems built using GCP. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for ensuring that all employees have completed screening requirements in accordance with the Customer Agencies’ screening requirements. \n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for automating the audit review, analysis, and reporting of suspicious activities within customer-deployed resources (to include applications, operating systems, databases, and software). The customer control implementation statement should address the automated mechanisms employed to support investigation and response to suspicious activities.",
      "Cloud.gov": "The application owner is responsible for ensuring that personnel security agreements are appropriately applied to third-party providers supporting the application."
    },
    {
      "Unique Controls": "AU-7(1)",
      "AWS": "",
      "GCP": "Customers should identify, select, and review impact levels (low, moderate or high) for all their information types utilizing FIPS 199 and SP 800-60. Customers are responsible for implementing agency specific data security controls requirements for Identified Information types not identified in the Section 2 of the Security Plan.\n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for analyzing and correlating audit records (defined in AU-06) across customer-deployed repositories. The customer control implementation statement should address the repositories used and how audit records are correlated across them to gain organization-wide situational awareness.",
      "Cloud.gov": "The application owner is responsible for ensuring that personnel sanction policies and procedures are enforced against application users when appropriate."
    },
    {
      "Unique Controls": "AU-8",
      "AWS": "",
      "GCP": "Customers are responsible for ensuring that products acquired to support their applications are FIPS-201 approved. Customers can configure and deploy automated mechanisms such as LDAP, SSO to authenticate to the GCP using second factor authenticators such as a PIV.",
      "Azure": "The customer is responsible for providing an audit reduction and report generation capability for customer-deployed resources (to include applications, operating systems, databases, and software). The customer control implementation statement should address how the system supports on-demand audit review, analysis, and reporting requirements, and after-the-fact investigations of security incidents.",
      "Cloud.gov": "cloud.gov inherits its implementation from GSA. The application leveraging cloud.gov will need to inherit the use of their agency's security policy. GSA applications can inherit cloud.gov's implementations."
    },
    {
      "Unique Controls": "AU-8(1)",
      "AWS": "",
      "GCP": "Customers are responsible for selecting the static code review tools that identify common flaws. Customers may elect to use the Cloud Security Scanner product within the Identify & Security product family to help address this requirement. Cloud Security Scanner is a web security scanner for common vulnerabilities in Google App Engine applications. It can automatically scan and detect four common vulnerabilities, including cross-site-scripting (XSS), Flash injection, mixed content (HTTP in HTTPS), and outdated/insecure libraries. \nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for ensuring the original content and time ordering of customer-controlled audit records is not altered. The customer control implementation statement should address how the process defined in AU-07.a maintains audit record integrity.",
      "Cloud.gov": "Application owners must ensure the security categorization of the cloud.gov platform is appropriate for the information processed by the application, that the application has the appropriate security categorization, and that the information processed by the application does not exceed that categorization."
    },
    {
      "Unique Controls": "AU-8a",
      "AWS": "",
      "GCP": "Customers are responsible for ensuring that their information systems resources built on GCP are protected against or limits the effects of denial of service attacks. Customer VMs are not behind the Google Front End (GFE) and require additional protection from DDOS attacks. Customers may elect to use the GCN multi-region load balancer in the Compute Engine product to get DDoS protection from Google; enable Google Cloud HTTP(s) and SSL proxy load balancing for their GCE instances to mitigate DDoS attacks; or purchase and configure another commercial product. Google Cloud Load balancers can handle a sudden spike in traffic by distributing the traffic across all the back ends with available capacity.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for providing the capability to process customer-controlled audit records for events of interest. The customer control implementation statement should address the customer-defined audit fields on which the events of interest will be based.",
      "Cloud.gov": "Application owners are responsible for having risk assessments performed on the application."
    },
    {
      "Unique Controls": "AU-8b",
      "AWS": "",
      "GCP": "Customer Responsibility:\nCustomers are responsible for ensuring that their GCP customer systems resources are connected to external network systems through managed interfaces that are consistent with organization’s security architecture. Not all user and application traffic is monitored by Google. Applications hosted on GCP may bypass the GFE if they are using Cloud VPN, Cloud Interconnect, or a single instance VM (since it uses a public IP address by default). Customers can segment their networks with a global distributed firewalls to restrict access to certain instances. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for generating time stamps for audit records of customer-deployed resources (to include applications, operating systems, databases, and software). The customer control implementation statement should address how internal system clocks are used to time-stamp audit records.",
      "Cloud.gov": "The application owner is responsible for code scanning. All resources including network, OS and DB are outside of the application owner boundary and are the responsibility of cloud.gov and GovCloud.\nThe application owner is responsible for ensuring the tools used for code scanning can be readily updated. All resources including network, OS and DB are outside of the application owner boundary and are the responsibility of cloud.gov and GovCloud.\nThe application owner is responsible for updating the tools used for code scanning before performing a code scan. All resources including network, OS and DB are outside of the application owner boundary and are the responsibility of cloud.gov and GovCloud.\nThe application owner is responsible for ensuring the tools used for code scanning are able to demonstrate the scope of vulnerabilities scanned for. All resources including network, OS and DB are outside of the application owner boundary and are the responsibility of cloud.gov and GovCloud.\nThe application owner is responsible for ensuring the tools used for code scanning are provided sufficient access to perform the full spectrum of scanning performed by the tool. All resources including network, OS and DB are outside of the application owner boundary and are the responsibility of cloud.gov and GovCloud.\nThe application owner is responsible for employing automated mechanisms to identify trends demonstrated by tools used for code scanning. All resources including network, OS and DB are outside of the application owner boundary and are the responsibility of cloud.gov and GovCloud.\nThe application owner is responsible for reviewing historic logs to determine if vulnerabilities identified by tools used for code scanning have been exploited. All resources including network, OS and DB are outside of the application owner boundary and are the responsibility of cloud.gov and GovCloud."
    },
    {
      "Unique Controls": "AU-9",
      "AWS": "",
      "GCP": "Customers are responsible for ensuring that their GCP information systems resources are connected to external network systems only through managed interfaces. Customer VMs have public IPs and can connect to the Internet by default. Customers may elect to use the Virtual Private Cloud located in the Networking product. Customers can provision GCP resources segmenting their networks with a global distributed firewalls to restrict access to certain instances. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for ensuring customer-controlled audit records have time stamps that are recorded and can be mapped to Coordinated Universal Time (UTC) or Greenwich Mean Time (GMT). The customer control implementation statement should define the process for mapping time stamps to UTC or GMT and the granularity of time measurement to be captured (e.g., hundreds of milliseconds or tens of milliseconds).",
      "Cloud.gov": "cloud.gov inherits its implementation from GSA. The application leveraging cloud.gov will need to inherit the use of their agency's security policy. GSA applications can inherit cloud.gov's implementations."
    },
    {
      "Unique Controls": "AU-9,",
      "AWS": "",
      "GCP": "Customer Responsibility:\nCustomers are responsible for ensuring that their GCP customer systems resources are connected to external network systems through managed interfaces that are consistent with organization’s security architecture. Not all user and application traffic is monitored by Google. Applications hosted on GCP may bypass the GFE if they are using Cloud VPN, Cloud Interconnect, or a single instance VM (since it uses a public IP address by default). Customers can segment their networks with a global distributed firewalls to restrict access to certain instances. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for comparing internal system clocks with an authoritative time source. The customer control implementation statement should address the authoritative time source selected and the frequency of comparison.\nFedRAMP Requirement: The customer is responsible for selecting time servers used by the NIST Internet time service. The customer control implementation statement should address the primary NIST time server selected and a secondary NIST time server selected from a different geographic region.",
      "Cloud.gov": "Application owners are responsible for maintaining configuration control of the application development."
    },
    {
      "Unique Controls": "AU-9(2)",
      "AWS": "",
      "GCP": "Customers are responsible for limiting the number of external network connections for customer systems utilizing GCP. Additionally, Customers are required to ensure that machines connecting to Google Cloud are configured to use appropriate encryption for Google-to-agency communications. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for establishing traffic flow policies for each of their managed interfaces \nthat are compliant with Agency requirements. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for protecting the confidentiality and integrity of information being transmitted across each customer managed interface. If using cryptographic mechanisms, customers should configure GCP customer applications and web browsers to use encryption that is compliant with Agency standards. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for documenting exceptions to traffic flow policies. Customers should follow Agency guidance for documenting and managing the list of exceptions. \n\nThere are no customer responsibilities for the GCI since it is not available for public use\"\n\"Customers are responsible for review exceptions to traffic flow policies on a regular basis. Customers should follow Agency requirements for frequency of exception list review.\n \nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for implementing a deny all; permit by exception policy at their managed interfaces. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for managing authenticated proxy servers at customer managed interfaces. Proxy servers should be configured to route internal and external traffic in agreement with Agency requirements. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are responsible for configuring their managed interfaces to prevent exfiltration of information.\n\nThere are no customer responsibilities for the GCI since it is not available for public use\"\n\"Customers are responsible for configuring all customer managed boundary protection devices to fail in a secure state. \n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for synchronizing internal system clocks to the authoritative time source defined in AU-08(01)a. The customer control implementation statement should address the time difference at which synchronization must occur.\nFedRAMP Requirement: The customer is responsible for synchronizing non-Windows systems to the organization's authoritative time source. The customer control implementation statement should address which internet time services are used for non-Windows systems.",
      "Cloud.gov": "Application owners are responsible for ensuring security testing is performed on the application during development."
    },
    {
      "Unique Controls": "AU-9(4)",
      "AWS": "",
      "GCP": "Customers are required to ensure that machines connecting to Google Cloud are configured to use an encryption for Google-to-agency communications that meets Agency requirements.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"Customers are required to ensure that machines connecting to GCP are configured to use appropriate encryption for Google-to-agency communications. It is the responsibility of federal customers to configure their browsers to meet federal encryption standards. \n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for preventing unauthorized access to audit information and tools. The customer implementation statement should address the mechanisms preventing unauthorized access modification and deletion.",
      "Cloud.gov": "Application owners are responsible for identifying and allocating appropriate resources to protect the application."
    },
    {
      "Unique Controls": "CA-1",
      "AWS": "",
      "GCP": "Customers are responsible for establishing and managing cryptographic keys for cryptography employed within their GCP instance. Customers may elect to use the Cloud Key Management Service which allows customers to manage encryptions for their GCP cloud services the same way they do in their local environment. The Cloud Key Management Service allows customers to generate, use, rotate and destroy FIPS 140-2 compliant cryptographic encryption keys. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.\"\n\"In Google Cloud Platform, the encryption key can be managed by one of the following options \n- Default Google encryption: KEKs are stored in Google Key Management Server (KMS).\n- Customer-managed encryption keys (CMEK) using Cloud KMS: A stand-alone service.\n- Customer-supplied encryption keys (CSEK): available in Compute and Storage services.\n\n\nIf customers choose to use CSEK to encrypt the GCE and GCS contents, Customers are responsible for maintaining availability of information in the event of loss of cryptographic key. Google does not have the ability to recover customer encrypted information stored in GCP Products.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for backing up customer-controlled audit records to a physically different system. The customer control implementation statement should address backup frequency and how the backup destination is separated physically from the source.",
      "Cloud.gov": "Application owners are responsible for using a system development life cycle to manage the life cycle of the application."
    },
    {
      "Unique Controls": "CA-2",
      "AWS": "",
      "GCP": "Customers are required to ensure that machines connecting to Google Cloud are configured to use appropriate encryption for Google-to-agency communications. \n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for restricting the management of customer-controlled audit resources to authorized users. The customer control implementation statement should address the subset of privileged users authorized to manage audit functionality.",
      "Cloud.gov": "Application owners are responsible for ensuring security controls and documentation are included as part of all application acquisitions."
    },
    {
      "Unique Controls": "CA-2(1)",
      "AWS": "",
      "GCP": "Customers are responsible for configuring web browsers to require secure connections when \nopening connections to GCP. Additionally, customers must configure end user devices to only use trusted DNS servers for handling domain name resolution. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for retaining audit records for customer-deployed resources (to include applications, operating systems, databases, and software) to support security investigations and meet regulatory requirements. The customer control implementation statement should address the retention period and/or corresponding records retention policy.",
      "Cloud.gov": "Application owners are responsible for ensuring documentation is provided for the application."
    },
    {
      "Unique Controls": "CA-2(2)",
      "AWS": "",
      "GCP": "Customers are responsible for configuring Web Browsers to require secure connections when \nopening connections to GCP. Additionally, customers must configure end user devices to only use trusted DNS servers for handling domain name resolution. \n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for ensuring all customer-deployed resources (to include applications, operating systems, databases, and software) have the ability to generate records for the auditable events defined in AU-02.a. The customer control implementation statement should address the system resources with the capability to generate the corresponding audit records.",
      "Cloud.gov": "Application owners are responsible for ensuring security engineering principles are applied during application development."
    },
    {
      "Unique Controls": "CA-2(3)",
      "AWS": "",
      "GCP": "Customers are responsible for configuring web browsers to use an encryption protocol that meets or exceeds Agency requirements. Customers are advised that United States Government Configuration Baseline (USGCB) standard restricts federal desktop client-side TLS handshake initiation to FIPS approved algorithms. \n\nThere are no customer responsibilities for the GCI since it is not available for public use",
      "Azure": "The customer is responsible for assigning personnel to select audit events for customer-deployed resources. The customer control implementation statement should address the assigned personnel/roles and the customer-deployed resources which will generate the corresponding audit records.",
      "Cloud.gov": "Application owners are responsible for ensuring security requirements are documented and applied to external services procured by the application.\nApplication owners are responsible for assessing the risk of using external services in the application."
    },
    {
      "Unique Controls": "CA-3",
      "AWS": "",
      "GCP": "Customers are responsible for ensuring applications built on GCP generate error messages that provide information necessary for corrective actions. Customers may use Stackdriver Error Reporting product located within Management Tools to identify and report errors. Stackdriver Error Reporting is a centralized error management interface that displays the results with sorting and filtering capabilities. Customers can use the dedicated view to show error details such as time charts, occurrences, affected user counts, first and last seen dates and a cleaned exception stack trace.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for generating audit records for the subset of auditable events identified in AU-02.d and content defined in AU-03 for customer-deployed resources. The customer control implementation statement should address how the audit records meet the criteria defined in AU-02 and AU-03.",
      "Cloud.gov": "cloud.gov inherits its implementation from GSA. The application leveraging cloud.gov will need to inherit the use of their agency's security policy. GSA applications can inherit cloud.gov's implementations."
    },
    {
      "Unique Controls": "CA-3(3)",
      "AWS": "",
      "GCP": "Customers are responsible for ensuring applications built on GCP generate error messages that provide information necessary for corrective actions. Customers may use Stackdriver Error Reporting product located within Management Tools to identify and report errors. Stackdriver Error Reporting is a centralized error management interface that displays the results with sorting and filtering capabilities. Customers can use the dedicated view to show error details such as time charts, occurrences, affected user counts, first and last seen dates and a cleaned exception stack trace.\n\nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for developing, documenting, reviewing, updating, and disseminating security assessment and authorization policy and procedures for the customer’s system. The customer control implementation statement should address the content of the policy (which must include purpose, scope, roles, responsibilities, management commitment, coordination, and compliance), procedures (which must facilitate the implementation of the policies and associated controls), the frequency of review, and the role(s) responsible.",
      "Cloud.gov": "Application owners are responsible for limiting access to their production environment by using the system-provided roles and disabling the ssh-allowed setting for production applications."
    },
    {
      "Unique Controls": "CA-3(5)",
      "AWS": "",
      "GCP": "Customers are responsible for handling and retaining information within applications built using GCP in accordance with all applicable agency requirements. Customer data is retained based on the customer’s contract. Upon the termination of the contract, Google will maintain the customer’s data for a limited time and can provide the data to the customer as specified in the contract. At the end of that time period, Google will destroy or sanitize the customer’s data per Google’s media destruction and sanitization processes. Information stored on hard drives remains within the data centers until destruction is performed in the data centers.\n\nGCP retains the audit logs for up to thirty (30) days. Customers must move the audit logs to another storage location at the end of this period. Customers may elect to use Bigtable, Datastore or any other product in Storage and Database product line to meet data retention needs. \nThere are no customer responsibilities for the GCI since it is not available for public use.",
      "Azure": "The customer is responsible for developing a security assessment plan for the customer-deployed system. The customer control implementation statement should address the scope of the assessment, including: controls and enhancements; assessment procedures; and the assessment environment, team, and roles/responsibilities.",
      "Cloud.gov": "cloud.gov rotates and maintains the security of all keys used in TLS. Application owners are responsible for rotating and securing any additional cryptographic keys that their system uses.\nApplication owners are responsible for the key management technology and process in use for any credentials they manage.\nIf the application utilizes asymmetric keys, the application owner is responsible for ensuring this control is fully implemented."
    },
    {
      "Unique Controls": "CA-3a",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for assessing the security controls defined in CA-02.a on customer-deployed resources. The customer control implementation statement should address the implementation, operation, and compliance of the controls, as well as the frequency of assessment.",
      "Cloud.gov": "Application owners are responsible for managing any credentials they create and use according to applicable laws and standards."
    },
    {
      "Unique Controls": "CA-3b",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for producing a security assessment report. The customer control implementation statement should address documenting the results of the assessment.",
      "Cloud.gov": "cloud.gov does not use collaborative computing devices. If the application implements collaborative computing technologies, the application owner is responsible for ensuring this control is fully implemented."
    },
    {
      "Unique Controls": "CA-3c",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for delivering the security assessment results to the required individuals/roles. The customer control implementation statement should address the individuals or roles the security assessment report (SAR) must be submitted to.",
      "Cloud.gov": "cloud.gov does not use PKI. If the application utilizes a PKI, the application owner is responsible for ensuring this control is fully implemented."
    },
    {
      "Unique Controls": "CA-5",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for employing independent assessors or assessment teams to conduct security control assessments. The customer control implementation statement should address and the level of independence required and the chosen assessor [i.e., an accredited third-party assessment organization (3PAO)].",
      "Cloud.gov": "The application owner is responsible for appropriately managing mobile code in the application."
    },
    {
      "Unique Controls": "CA-6",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for the selection of additional testing to be included as part of security control assessments. The customer control implementation statement should address the selected testing mechanisms \n(e.g., in-depth monitoring; vulnerability scanning; malicious user testing; insider threat assessment; performance/load testing; and/or customer-defined mechanisms), the frequency of these specialized assessments and whether they are announced or unannounced.",
      "Cloud.gov": "cloud.gov does not support VOIP."
    },
    {
      "Unique Controls": "CA-6a",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for accepting assessment results for customer-deployed resources. The customer control implementation statement should address the resources assessed, the external organization performing the assessment, and the requirements that, when met, will result in customer acceptance of the assessment.",
      "Cloud.gov": "For the application owner boundary, all separation of functionality is the responsibility of the application owner."
    },
    {
      "Unique Controls": "CA-6b",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for authorizing connections from the customer-deployed system to external systems. The customer control implementation statement should address how connections are authorized through the use of Interconnection Security Assessments.",
      "Cloud.gov": "cloud.gov handles data origin authentication and integrity verification for *.cloud.gov domains. Application owners are responsible for selecting a name resolution service that fulfills this requirement and any requirements of their respective agency for any custom domain in use."
    },
    {
      "Unique Controls": "CA-7",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for documenting the details of each interconnection defined in CA-03.a. The customer control implementation statement should address each interconnection's interface characteristics, security requirements, and information communicated.",
      "Cloud.gov": "cloud.gov does not manage customer DNS."
    },
    {
      "Unique Controls": "CA-7(1)",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for reviewing and updating Interconnection Security Agreements. The customer control implementation statement should address the review and update frequency.",
      "Cloud.gov": "cloud.gov has built-in encryption at rest. If desirable, customers are responsible for further encrypting any sensitive information in their customer applications before it is written to storage components or databases.\ncloud.gov has built-in cryptographic mechanisms to prevent unauthorized disclosure and modification of data. Customers are responsible for further securing/encrypting any sensitive information in their customer applications, and for auditing the permissions their users have for managing their applications."
    },
    {
      "Unique Controls": "CA-7a",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for prohibiting the direct connection of customer-controlled, unclassified non-national security systems to an external network without the use of appropriate boundary protection devices. The customer control implementation statement should address the unclassified non-national security resources and the boundary protection devices (e.g., routers, firewalls) in place for processing, storing, or transmitting Controlled Unclassified Information (CUI) to an external network.",
      "Cloud.gov": "The technical functionality of separation is provided by cloud.gov through encryption. The application owner is responsible for the operational access authorization to the appropriate repositories."
    },
    {
      "Unique Controls": "CA-7b",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for employing restrictions on external system interconnections. The customer control implementation statement should address the selected policy (e.g., allow-all, deny-by-exception; deny-all, permit-by-exception) and the customer-deployed resources connecting to external systems.",
      "Cloud.gov": "Application owners are responsible for provisioning enough application instances to handle legitimate traffic that reaches their application, and for responding to traffic in ways that do not prevent the application from responding to other legitimate requests."
    },
    {
      "Unique Controls": "CA-7c",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for developing a plan of action and milestones (POA&M) for customer-deployed resources (to include applications, operating systems, databases, and software). The customer control implementation statement should address the customer's planned remedial actions to correct deficiencies noted during the security assessment (see CA-02) and to reduce/eliminate known vulnerabilities in the system. Additionally, any vulnerabilities found as a result of regular vulnerability scanning (see RA-05) must be included in POA&M reporting.",
      "Cloud.gov": "The application owner must ensure they have allocated appropriate resources to their application within cloud.gov, such as setting an appropriate memory quota limit."
    },
    {
      "Unique Controls": "CA-7d",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for updating POA&M items defined in CA-05.a. The customer control implementation statement should address the frequency with which POA&M items will be updated based on findings from security assessments, impact analyses, and continuous monitoring activities.",
      "Cloud.gov": "Application owners are responsible for ensuring their application does not exchange traffic with systems outside its own boundary over unsanctioned or unmonitored interfaces.\nApplication owners are responsible for appropriately separating their applications from each other using system-provided spaces, application security groups, or isolation segments.\ncloud.gov allows all legitimately-directed traffic from the internet to reach the customer's application via non-internal routes. Application owners are responsible for using an internal route or applying default deny policies (eg via route-service) where a default-deny policy is the appropriate configuration for their application.\nApplication owners are responsible for ensuring their application does not tunnel client traffic to networks outside of its boundary inappropriately.\nApplication owners are responsible for ensuring their traffic to cloud.gov APIs and application instances traverses their monitored agency network boundary, for example by configuring the allowed IP ranges for users from their domain."
    },
    {
      "Unique Controls": "CA-7e",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for assigning an authorizing official (AO) for customer-deployed resources. The customer control implementation statement should address the senior-level executive or manager assigned.",
      "Cloud.gov": "HTTS is enforced on customer applications by default. The configuration of stricter encryption is the responsibility of the application owners."
    },
    {
      "Unique Controls": "CA-7f",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for ensuring customer-deployed resources are authorized before operations commence. The customer control implementation statement should address how the AO has authorized the customer-deployed resources for processing.",
      "Cloud.gov": "cloud.gov inherits its implementation from GSA. The application leveraging cloud.gov will need to inherit the use of their agency's security policy. GSA applications can inherit cloud.gov's implementations."
    },
    {
      "Unique Controls": "CA-7g",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for updating the security authorization for customer-deployed resources. The customer control implementation statement should address the frequency in which the authorization will be updated.",
      "Cloud.gov": "The application owner is responsible for ensuring input to the application is validated."
    },
    {
      "Unique Controls": "CA-8",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for developing a continuous monitoring strategy and implementing a continuous monitoring program for customer-deployed resources (to include applications, operating systems, databases, and software). The customer control implementation statement should address the metrics to be monitored.\nFedRAMP Requirement: The customer is responsible for performing vulnerability scans on customer-deployed operating systems, web applications, and databases, at least monthly.",
      "Cloud.gov": "The application owner is responsible for ensuring application error messages do not reveal sensitive information to unauthorized users."
    },
    {
      "Unique Controls": "CA-8(1)",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for continuously monitoring customer-deployed resources and performing supporting assessments of that monitoring activity. The customer control implementation statement should address the frequency with which monitoring and supporting assessments will be performed. \nFedRAMP Requirement: The customer is responsible for performing vulnerability scans on customer-deployed operating systems, web applications, and databases, at least monthly.",
      "Cloud.gov": "If the application has additional information handling and storage requirements beyond what cloud.gov provides it must establish the mechanisms to meet the requirements."
    },
    {
      "Unique Controls": "CA-9",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for ongoing security assessments. The customer control implementation statement should address how these assessments are in accordance with the customer's continuous monitoring strategy. \nFedRAMP Requirement: The customer is responsible for having an independent assessor perform vulnerability scans, at least annually. The customer control implementation statement should address frequency with which scans are performed.",
      "Cloud.gov": "The application owner is responsible for scanning for and addressing flaws in application code.\nThe application owner is responsible for employing automated mechanisms to scan for flaws in application code.\nThe application owner is responsible for responding to flaws in application code within appropriate timeframes for the application ATO."
    },
    {
      "Unique Controls": "CM-1",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for ongoing security status monitoring of the metrics defined in CA-07.a. The customer control implementation statement should address how this monitoring is in accordance with the customer's continuous monitoring strategy.",
      "Cloud.gov": "The application owner is responsible for ensuring that application code does not introduce malicious code into the environment."
    },
    {
      "Unique Controls": "CM-10",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for correlating and analyzing security-related information generated by assessments and monitoring of customer-deployed resources. The customer control implementation statement should address how this information is correlated and analyzed.",
      "Cloud.gov": "Application owners are responsible for monitoring their application logs for signs of unauthorized activity according to laws and regulations, and applying heightened scrutiny when there is an indication of increased risk.\nApplication owners are responsible for conveying cloud.gov-collected logs to their own intrusion detection system where applicable.\ncloud.gov supplies a real-time feed of events related to customer applications. Application owners are responsible for using correlating these events with other events gathered throughout their systems.\ncloud.gov supplies a real-time feed of events related to customer applications. Application owners are responsible for using automated tools to interpret and analyze these events.\nApplication owners must establish the SLA with cloud.gov for reporting malicious code detection that effects the application."
    },
    {
      "Unique Controls": "CM-10(1)",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for responding to the results of the analysis defined in CA-07.e. The customer control implementation statement should address under which conditions each response action should be taken (e.g., if a new vulnerability is found in the system, a POA&M item should be opened).",
      "Cloud.gov": "The application owner is responsible for ensuring the application personnel monitor and respond to security alerts and advisories that affect the application."
    },
    {
      "Unique Controls": "CM-11",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for reporting the security status of customer-deployed resources. The customer control implementation statement should address which personnel/roles will be notified of the security status and the frequency with which reporting will occur.",
      "Cloud.gov": "The application owner is responsible for ensuring the application verifies correct operation of the application."
    },
    {
      "Unique Controls": "CM-2",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for employing independent assessors or assessment teams to monitor security controls for customer-deployed resources on an ongoing basis. The customer control implementation statement should address and the level of independence required and the chosen assessor [i.e., an accredited third-party assessment organization (3PAO)].",
      "Cloud.gov": "Application owners are responsible for detecting unauthorized changes to their deployed application.\ncloud.gov always restarts customer applications based on the original version that the customer supplied. Application owners are responsible for making sure that their applications are restarted appropriately often.\nApplication owners are responsible for incorporating detection of unauthorized changes into their incident response capability."
    },
    {
      "Unique Controls": "CM-2(1)",
      "AWS": "",
      "GCP": "",
      "Azure": "The customer is responsible for conducting penetration testing for customer-deployed resources. The customer control implementation statement should address the frequency of testing and the resources tested.",
      "Cloud.gov": "If the application processes messages, all spam protections are the responsibility of the application owner."
    }
  ]